{
  "claim": "People in England spend more time working now than in the past.",
  "Args": {
    "A1": {
      "supporting": {
        "id": "A1",
        "cate": "P",
        "text": "Technological advancements have increased remote work opportunities, allowing people in England to work longer hours outside traditional office settings."
      },
      "attacks": [
        {
          "id": "A1",
          "text": "Technological advancements have increased remote work opportunities, allowing people in England to work longer hours outside traditional office settings.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Remote work often leads to better work-life balance, reducing overall working hours as people prioritize personal time.",
          "confidence": 0.65,
          "attacks": {
            "A1": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Studies show remote workers frequently work overtime due to blurred boundaries between work and home life.",
          "confidence": 0.72,
          "attacks": {
            "B1": 0.8
          }
        },
        {
          "id": "B2",
          "text": "Technological advancements have also increased automation, reducing the need for human labor in many sectors.",
          "confidence": 0.68,
          "attacks": {
            "A1": 0.6
          }
        },
        {
          "id": "C2",
          "text": "Automation primarily affects routine tasks, while knowledge workers face increased workloads due to higher expectations.",
          "confidence": 0.7,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    },
    "A2": {
      "supporting": {
        "id": "A2",
        "cate": "P",
        "text": "The gig economy has expanded in England, leading to more people taking on multiple jobs or side hustles, thereby increasing total working hours."
      },
      "attacks": [
        {
          "id": "A2",
          "text": "The gig economy has expanded in England, leading to more people taking on multiple jobs or side hustles, thereby increasing total working hours.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "The gig economy often involves flexible or part-time work, which may not necessarily increase total working hours compared to traditional full-time employment.",
          "confidence": 0.65,
          "attacks": {
            "A2": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Studies show that gig workers often work fewer hours than full-time employees due to the lack of guaranteed work.",
          "confidence": 0.7,
          "attacks": {
            "B1": 0.8
          }
        },
        {
          "id": "B2",
          "text": "The rise of automation and remote work has reduced the need for long working hours in many sectors.",
          "confidence": 0.68,
          "attacks": {
            "A2": 0.55
          }
        },
        {
          "id": "C2",
          "text": "Automation has primarily affected manufacturing, while the gig economy is more prevalent in service sectors, so the impact on working hours may vary by industry.",
          "confidence": 0.72,
          "attacks": {
            "B2": 0.7
          }
        }
      ]
    },
    "A3": {
      "supporting": {
        "id": "A3",
        "cate": "S",
        "text": "Labor laws in England, such as the Working Time Regulations 1998, cap weekly working hours at 48, which may limit increases in working time compared to the past."
      },
      "attacks": [
        {
          "id": "A3",
          "text": "Labor laws in England, such as the Working Time Regulations 1998, cap weekly working hours at 48, which may limit increases in working time compared to the past.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "The cap on working hours does not account for unpaid overtime or informal work arrangements that may increase actual working time beyond the legal limit.",
          "confidence": 0.65,
          "attacks": {
            "A3": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Studies show that enforcement of the Working Time Regulations is weak, and many employees are pressured to work beyond the cap without reporting it.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.85
          }
        },
        {
          "id": "B2",
          "text": "Historical data indicates that average working hours in England have decreased since the Industrial Revolution, contradicting the claim.",
          "confidence": 0.9,
          "attacks": {
            "A3": 0.95
          }
        },
        {
          "id": "C2",
          "text": "The decrease in average working hours is offset by the rise of multiple jobs or gig economy work, which may not be fully captured in historical comparisons.",
          "confidence": 0.7,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    },
    "A4": {
      "supporting": {
        "id": "A4",
        "cate": "S",
        "text": "Historical data shows that industrial revolution-era workers in England often worked 12-16 hour days, far exceeding modern average working hours."
      },
      "attacks": [
        {
          "id": "A4",
          "text": "Historical data shows that industrial revolution-era workers in England often worked 12-16 hour days, far exceeding modern average working hours.",
          "cate": "S",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Modern work includes unpaid overtime and digital connectivity, blurring traditional working hours.",
          "confidence": 0.75,
          "attacks": {
            "A4": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Industrial revolution data primarily reflects manual laborers, while modern comparisons require service/knowledge economy adjustments.",
          "confidence": 0.82,
          "attacks": {
            "A4": 0.8
          }
        },
        {
          "id": "B2",
          "text": "Life expectancy during industrial revolution was significantly lower, making long hours unsustainable by modern standards.",
          "confidence": 0.88,
          "attacks": {
            "A4": 0.85
          }
        },
        {
          "id": "B3",
          "text": "Government data shows UK average weekly hours have remained stable (37-40 hours) since 1992 when proper recording began.",
          "confidence": 0.9,
          "attacks": {
            "A4": 0.6
          }
        },
        {
          "id": "C2",
          "text": "Victorian work patterns included frequent breaks and seasonal variations absent in modern continuous work cycles.",
          "confidence": 0.78,
          "attacks": {
            "B3": 0.65
          }
        }
      ]
    },
    "A5": {
      "supporting": {
        "id": "A5",
        "cate": "P",
        "text": "Increased economic pressures, such as rising living costs, have pushed many in England to work longer hours to maintain their standard of living."
      },
      "attacks": [
        {
          "id": "A5",
          "text": "Increased economic pressures, such as rising living costs, have pushed many in England to work longer hours to maintain their standard of living.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Official statistics show that average weekly working hours in England have remained stable or slightly decreased over the past two decades.",
          "confidence": 0.82,
          "attacks": {
            "A5": 0.85
          }
        },
        {
          "id": "C1",
          "text": "The stability in official statistics may not capture informal or undeclared overtime work, which has likely increased due to economic pressures.",
          "confidence": 0.65,
          "attacks": {
            "B1": 0.7
          }
        },
        {
          "id": "B2",
          "text": "Technological advancements have increased productivity, allowing people to maintain their standard of living without working longer hours.",
          "confidence": 0.78,
          "attacks": {
            "A5": 0.8
          }
        },
        {
          "id": "C2",
          "text": "Productivity gains have not been evenly distributed, and many workers face stagnant wages despite increased productivity.",
          "confidence": 0.72,
          "attacks": {
            "B2": 0.75
          }
        },
        {
          "id": "B3",
          "text": "Work-life balance initiatives and flexible working arrangements have become more common, potentially reducing average working hours.",
          "confidence": 0.7,
          "attacks": {
            "A5": 0.68
          }
        },
        {
          "id": "C3",
          "text": "Flexible working often leads to 'always-on' culture, where employees work longer but less measurable hours.",
          "confidence": 0.65,
          "attacks": {
            "B3": 0.7
          }
        }
      ]
    },
    "A6": {
      "supporting": {
        "id": "A6",
        "cate": "S",
        "text": "The adoption of flexible working arrangements and part-time work has grown, potentially reducing average working hours compared to past decades."
      },
      "attacks": [
        {
          "id": "A6",
          "text": "The adoption of flexible working arrangements and part-time work has grown, potentially reducing average working hours compared to past decades.",
          "cate": "S",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Despite flexible work arrangements, full-time employees in England often work unpaid overtime, increasing total working hours.",
          "confidence": 0.65,
          "attacks": {
            "A6": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Studies show that unpaid overtime is declining due to stricter labor regulations and workplace monitoring.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.85
          }
        },
        {
          "id": "B2",
          "text": "The gig economy has increased the number of people working multiple jobs, leading to higher cumulative working hours.",
          "confidence": 0.7,
          "attacks": {
            "A6": 0.75
          }
        },
        {
          "id": "C2",
          "text": "Gig economy workers represent a small fraction of the workforce, and their impact on average working hours is marginal.",
          "confidence": 0.6,
          "attacks": {
            "B2": 0.65
          }
        }
      ]
    }
  }
}