{
  "claim": "The working hours of Americans have increased over time.",
  "Args": {
    "A1": {
      "supporting": {
        "id": "A1",
        "cate": "P",
        "text": "Studies show that the average American workweek has increased since the mid-20th century, with more employees working over 40 hours per week."
      },
      "attacks": [
        {
          "id": "A1",
          "text": "Studies show that the average American workweek has increased since the mid-20th century, with more employees working over 40 hours per week.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "The increase in workweek hours is primarily due to a rise in part-time and gig economy jobs, not full-time employment.",
          "confidence": 0.75,
          "attacks": {
            "A1": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Even part-time and gig jobs contribute to the overall average workweek, so the claim still holds.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.85
          }
        },
        {
          "id": "B2",
          "text": "Technological advancements have increased productivity, reducing the need for longer work hours in many sectors.",
          "confidence": 0.78,
          "attacks": {
            "A1": 0.75
          }
        },
        {
          "id": "C2",
          "text": "Despite productivity gains, many industries still require long hours due to competitive pressures.",
          "confidence": 0.72,
          "attacks": {
            "B2": 0.8
          }
        },
        {
          "id": "B3",
          "text": "The data does not account for the rise in remote work, which may blur the line between work and personal time.",
          "confidence": 0.68,
          "attacks": {
            "A1": 0.65
          }
        },
        {
          "id": "C3",
          "text": "Studies specifically measure hours worked, regardless of location, so remote work does not invalidate the claim.",
          "confidence": 0.82,
          "attacks": {
            "B3": 0.88
          }
        }
      ]
    },
    "A2": {
      "supporting": {
        "id": "A2",
        "cate": "P",
        "text": "The rise of the gig economy and remote work has blurred the boundaries between work and personal life, leading to longer working hours for many Americans."
      },
      "attacks": [
        {
          "id": "A2",
          "text": "The rise of the gig economy and remote work has blurred the boundaries between work and personal life, leading to longer working hours for many Americans.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Studies show that while some remote workers report longer hours, others experience increased flexibility and reduced working hours due to eliminated commutes.",
          "confidence": 0.68,
          "attacks": {
            "A2": 0.7
          }
        },
        {
          "id": "C1",
          "text": "The gig economy represents a small fraction of the workforce, and its impact on overall working hours may be overstated.",
          "confidence": 0.72,
          "attacks": {
            "A2": 0.65
          }
        },
        {
          "id": "D1",
          "text": "Government labor statistics indicate that average weekly working hours have remained stable or slightly decreased over the past two decades.",
          "confidence": 0.85,
          "attacks": {
            "A2": 0.8
          }
        },
        {
          "id": "B2",
          "text": "The perception of longer hours may be due to increased work intensity rather than actual extended working time.",
          "confidence": 0.7,
          "attacks": {
            "A2": 0.6
          }
        },
        {
          "id": "C2",
          "text": "Technological advancements have made work more measurable, creating an illusion of longer hours when workers are simply more aware of their time allocation.",
          "confidence": 0.65,
          "attacks": {
            "B2": 0.55
          }
        }
      ]
    },
    "A3": {
      "supporting": {
        "id": "A3",
        "cate": "S",
        "text": "Labor laws and regulations, such as the Fair Labor Standards Act, have historically limited working hours, preventing significant increases over time."
      },
      "attacks": [
        {
          "id": "A3",
          "text": "Labor laws and regulations, such as the Fair Labor Standards Act, have historically limited working hours, preventing significant increases over time.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Despite labor laws, many Americans work unpaid overtime or multiple jobs to meet financial needs, leading to increased working hours.",
          "confidence": 0.7,
          "attacks": {
            "A3": 0.8
          }
        },
        {
          "id": "C1",
          "text": "Studies show that salaried employees are often exempt from overtime pay, encouraging employers to demand longer hours without additional compensation.",
          "confidence": 0.85,
          "attacks": {
            "B1": 0.9
          }
        },
        {
          "id": "B2",
          "text": "The rise of the gig economy has led to more people working irregular and often longer hours without the protections of traditional labor laws.",
          "confidence": 0.78,
          "attacks": {
            "A3": 0.85
          }
        },
        {
          "id": "C2",
          "text": "Gig workers often have no fixed working hours, making it difficult to measure whether their total working hours have increased or decreased.",
          "confidence": 0.65,
          "attacks": {
            "B2": 0.7
          }
        },
        {
          "id": "B3",
          "text": "Technological advancements have blurred the line between work and personal life, leading to an increase in working hours outside traditional office settings.",
          "confidence": 0.8,
          "attacks": {
            "A3": 0.85
          }
        },
        {
          "id": "C3",
          "text": "Remote work can also lead to more flexible schedules, potentially reducing overall working hours for some employees.",
          "confidence": 0.7,
          "attacks": {
            "B3": 0.75
          }
        }
      ]
    },
    "A4": {
      "supporting": {
        "id": "A4",
        "cate": "P",
        "text": "Technological advancements have made employees more accessible outside traditional working hours, contributing to longer perceived workdays."
      },
      "attacks": [
        {
          "id": "A4",
          "text": "Technological advancements have made employees more accessible outside traditional working hours, contributing to longer perceived workdays.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Studies show that while accessibility has increased, actual working hours have remained stable or decreased due to productivity gains from technology.",
          "confidence": 0.68,
          "attacks": {
            "A4": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Productivity gains may not offset the psychological burden of constant accessibility, which still contributes to longer perceived workdays.",
          "confidence": 0.6,
          "attacks": {
            "B1": 0.65
          }
        },
        {
          "id": "B2",
          "text": "Many companies have implemented policies to limit after-hours communication, reducing the impact of accessibility on actual working hours.",
          "confidence": 0.55,
          "attacks": {
            "A4": 0.6
          }
        },
        {
          "id": "C2",
          "text": "Such policies are often poorly enforced, especially in high-pressure industries, maintaining the effect described in A4.",
          "confidence": 0.5,
          "attacks": {
            "B2": 0.55
          }
        }
      ]
    },
    "A5": {
      "supporting": {
        "id": "A5",
        "cate": "S",
        "text": "Data from the Bureau of Labor Statistics indicates that average weekly hours for full-time workers have remained relatively stable over the past few decades."
      },
      "attacks": [
        {
          "id": "A5",
          "text": "Data from the Bureau of Labor Statistics indicates that average weekly hours for full-time workers have remained relatively stable over the past few decades.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "The data only covers full-time workers, ignoring part-time workers whose hours may have increased.",
          "confidence": 0.7,
          "attacks": {
            "A5": 0.65
          }
        },
        {
          "id": "C1",
          "text": "Part-time work has become more common, but the average hours per worker may still have decreased when considering all workers.",
          "confidence": 0.6,
          "attacks": {
            "B1": 0.55
          }
        },
        {
          "id": "B2",
          "text": "The Bureau of Labor Statistics data does not account for unpaid overtime or off-the-clock work, which has reportedly increased.",
          "confidence": 0.75,
          "attacks": {
            "A5": 0.7
          }
        },
        {
          "id": "C2",
          "text": "Studies show that unpaid overtime is more prevalent in certain industries but has not significantly impacted the overall average.",
          "confidence": 0.65,
          "attacks": {
            "B2": 0.6
          }
        },
        {
          "id": "B3",
          "text": "The stability in weekly hours masks an increase in annual hours due to fewer vacation days and more year-round work.",
          "confidence": 0.8,
          "attacks": {
            "A5": 0.75
          }
        }
      ]
    },
    "A6": {
      "supporting": {
        "id": "A6",
        "cate": "P",
        "text": "The decline of unionization has reduced collective bargaining power, leading to fewer protections against excessive working hours."
      },
      "attacks": [
        {
          "id": "A6",
          "text": "The decline of unionization has reduced collective bargaining power, leading to fewer protections against excessive working hours.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Many industries have adopted labor-friendly policies independently of union influence, mitigating the impact of declining unionization.",
          "confidence": 0.65,
          "attacks": {
            "A6": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Studies show that non-unionized workplaces often have longer working hours compared to unionized ones, supporting the original argument.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.75
          }
        },
        {
          "id": "B2",
          "text": "Technological advancements and remote work have increased flexibility, reducing the need for strict working hour protections.",
          "confidence": 0.7,
          "attacks": {
            "A6": 0.65
          }
        },
        {
          "id": "C2",
          "text": "Despite flexibility, many remote workers report working longer hours due to blurred boundaries between work and personal life.",
          "confidence": 0.78,
          "attacks": {
            "B2": 0.7
          }
        }
      ]
    }
  }
}