{
  "claim": "Sitting close to the television can cause eyestrain.",
  "Args": {
    "A1": {
      "supporting": {
        "id": "A1",
        "cate": "P",
        "text": "Prolonged focus on a nearby screen forces the eye muscles to work harder to maintain focus, leading to eyestrain."
      },
      "attacks": [
        {
          "id": "A1",
          "text": "Prolonged focus on a nearby screen forces the eye muscles to work harder to maintain focus, leading to eyestrain.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Modern screens emit less harmful light and have features like blue light filters, reducing the risk of eyestrain.",
          "confidence": 0.75,
          "attacks": {
            "A1": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Even with modern screens, prolonged close viewing can still cause temporary discomfort due to sustained accommodation effort.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.75
          }
        },
        {
          "id": "B2",
          "text": "Eyestrain is more commonly caused by lack of breaks during screen use rather than viewing distance alone.",
          "confidence": 0.78,
          "attacks": {
            "A1": 0.65
          }
        },
        {
          "id": "C2",
          "text": "Viewing distance remains a contributing factor when combined with prolonged use without breaks.",
          "confidence": 0.72,
          "attacks": {
            "B2": 0.6
          }
        },
        {
          "id": "B3",
          "text": "There is no conclusive scientific evidence that normal TV viewing distances cause permanent eye damage.",
          "confidence": 0.7,
          "attacks": {
            "A1": 0.55
          }
        },
        {
          "id": "C3",
          "text": "While permanent damage is unproven, temporary eyestrain symptoms are well-documented at close viewing distances.",
          "confidence": 0.8,
          "attacks": {
            "B3": 0.75
          }
        }
      ]
    },
    "A2": {
      "supporting": {
        "id": "A2",
        "cate": "P",
        "text": "The American Academy of Ophthalmology states that sitting too close to the TV can cause temporary eye discomfort due to excessive focusing effort."
      },
      "attacks": [
        {
          "id": "A2",
          "text": "The American Academy of Ophthalmology states that sitting too close to the TV can cause temporary eye discomfort due to excessive focusing effort.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Modern TVs emit less harmful radiation and have better display technology, reducing the risk of eyestrain compared to older models.",
          "confidence": 0.75,
          "attacks": {
            "A2": 0.65
          }
        },
        {
          "id": "C1",
          "text": "Even with modern technology, prolonged close-up viewing can still cause eye fatigue due to sustained focus at a fixed distance.",
          "confidence": 0.7,
          "attacks": {
            "B1": 0.6
          }
        },
        {
          "id": "B2",
          "text": "The American Academy of Ophthalmology's statement is based on older studies and may not account for recent advancements in screen technology.",
          "confidence": 0.68,
          "attacks": {
            "A2": 0.55
          }
        },
        {
          "id": "C2",
          "text": "The core issue of excessive focusing effort remains relevant regardless of screen technology, as it is a physiological response.",
          "confidence": 0.72,
          "attacks": {
            "B2": 0.65
          }
        }
      ]
    },
    "A3": {
      "supporting": {
        "id": "A3",
        "cate": "P",
        "text": "Blue light emitted from screens at close range can contribute to digital eye strain, as supported by optometric research."
      },
      "attacks": [
        {
          "id": "A3",
          "text": "Blue light emitted from screens at close range can contribute to digital eye strain, as supported by optometric research.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Most modern screens have blue light filters or low-blue-light modes that mitigate this risk significantly.",
          "confidence": 0.75,
          "attacks": {
            "A3": 0.7
          }
        },
        {
          "id": "B2",
          "text": "Eyestrain from screens is more strongly linked to prolonged use than proximity, as shown in ergonomic studies.",
          "confidence": 0.8,
          "attacks": {
            "A3": 0.8
          }
        },
        {
          "id": "C1",
          "text": "Blue light filters are often not enabled by default, and many users are unaware of them.",
          "confidence": 0.65,
          "attacks": {
            "B1": 0.6
          }
        },
        {
          "id": "C2",
          "text": "Even with reduced blue light, close-range viewing still forces the eyes to converge unnaturally for extended periods.",
          "confidence": 0.7,
          "attacks": {
            "B1": 0.65
          }
        },
        {
          "id": "D1",
          "text": "Public awareness campaigns have significantly increased adoption of blue light filters in recent years.",
          "confidence": 0.6,
          "attacks": {
            "C1": 0.55
          }
        }
      ]
    },
    "A4": {
      "supporting": {
        "id": "A4",
        "cate": "P",
        "text": "Children, in particular, may experience eyestrain from sitting too close to the TV because their developing eyes are more sensitive to prolonged near-focus tasks."
      },
      "attacks": [
        {
          "id": "A4",
          "text": "Children, in particular, may experience eyestrain from sitting too close to the TV because their developing eyes are more sensitive to prolonged near-focus tasks.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Modern TVs emit significantly less harmful radiation and have better display technologies, reducing the risk of eyestrain even at close distances.",
          "confidence": 0.65,
          "attacks": {
            "A4": 0.7
          }
        },
        {
          "id": "B2",
          "text": "There is no conclusive scientific evidence linking sitting close to the TV to permanent eyestrain in children.",
          "confidence": 0.6,
          "attacks": {
            "A4": 0.65
          }
        },
        {
          "id": "C1",
          "text": "Even with modern display technologies, prolonged near-focus tasks can still cause temporary discomfort and fatigue in children's eyes.",
          "confidence": 0.7,
          "attacks": {
            "B1": 0.75
          }
        },
        {
          "id": "C2",
          "text": "While permanent damage may not be proven, temporary eyestrain can still affect children's comfort and focus, supporting the original claim.",
          "confidence": 0.68,
          "attacks": {
            "B2": 0.7
          }
        }
      ]
    },
    "A5": {
      "supporting": {
        "id": "A5",
        "cate": "P",
        "text": "Reduced blinking while focusing on a nearby screen can lead to dry eyes, a common symptom of eyestrain."
      },
      "attacks": [
        {
          "id": "A5",
          "text": "Reduced blinking while focusing on a nearby screen can lead to dry eyes, a common symptom of eyestrain.",
          "cate": "P",
          "confidence": 0.82,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Dry eyes from reduced blinking is temporary and does not necessarily lead to long-term eyestrain.",
          "confidence": 0.65,
          "attacks": {
            "A5": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Prolonged dry eyes can cause chronic discomfort and exacerbate existing vision problems, reinforcing the link to eyestrain.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.7
          }
        },
        {
          "id": "B2",
          "text": "Modern screens emit less harmful light and have features like blue light filters, reducing the risk of eyestrain regardless of distance.",
          "confidence": 0.78,
          "attacks": {
            "A5": 0.8
          }
        },
        {
          "id": "C2",
          "text": "Even with reduced harmful emissions, prolonged close-up screen use still strains eye muscles due to sustained focus at a fixed distance.",
          "confidence": 0.72,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    },
    "A6": {
      "supporting": {
        "id": "A6",
        "cate": "P",
        "text": "The contrast and brightness of modern screens at close range can cause visual fatigue over extended viewing periods."
      },
      "attacks": [
        {
          "id": "A6",
          "text": "The contrast and brightness of modern screens at close range can cause visual fatigue over extended viewing periods.",
          "cate": "P",
          "confidence": 0.8,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Modern screens often include features like blue light filters and adaptive brightness to reduce eyestrain.",
          "confidence": 0.7,
          "attacks": {
            "A6": 0.65
          }
        },
        {
          "id": "C1",
          "text": "Blue light filters and adaptive brightness are not universally effective and may not fully prevent visual fatigue.",
          "confidence": 0.6,
          "attacks": {
            "B1": 0.55
          }
        },
        {
          "id": "B2",
          "text": "Eyestrain from screens is more related to prolonged use rather than proximity to the screen.",
          "confidence": 0.75,
          "attacks": {
            "A6": 0.7
          }
        },
        {
          "id": "C2",
          "text": "Proximity to the screen can exacerbate eyestrain when combined with prolonged use, especially in poorly lit environments.",
          "confidence": 0.65,
          "attacks": {
            "B2": 0.6
          }
        }
      ]
    }
  }
}