{
  "claim": "During the Middle Ages, scholars thought the Earth was round.",
  "Args": {
    "A1": {
      "supporting": {
        "id": "A1",
        "cate": "P",
        "text": "Ancient Greek scholars such as Pythagoras and Aristotle argued for a spherical Earth, and their works were preserved and studied by medieval scholars."
      },
      "attacks": [
        {
          "id": "A1",
          "text": "Ancient Greek scholars such as Pythagoras and Aristotle argued for a spherical Earth, and their works were preserved and studied by medieval scholars.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "While ancient Greek works were preserved, many medieval scholars rejected or ignored these ideas in favor of flat Earth beliefs.",
          "confidence": 0.65,
          "attacks": {
            "A1": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Historical records show that prominent medieval scholars like Thomas Aquinas and Isidore of Seville explicitly supported the spherical Earth theory.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.75
          }
        },
        {
          "id": "B2",
          "text": "The Catholic Church, which dominated medieval scholarship, suppressed non-religious scientific ideas including the spherical Earth.",
          "confidence": 0.5,
          "attacks": {
            "A1": 0.4
          }
        },
        {
          "id": "C2",
          "text": "The Church actually preserved many Greek scientific texts in monasteries and never officially condemned the spherical Earth theory.",
          "confidence": 0.7,
          "attacks": {
            "B2": 0.8
          }
        }
      ]
    },
    "A2": {
      "supporting": {
        "id": "A2",
        "cate": "P",
        "text": "The medieval scholar Thomas Aquinas referenced Aristotle's spherical Earth theory in his works, indicating widespread acceptance among educated individuals."
      },
      "attacks": [
        {
          "id": "A2",
          "text": "The medieval scholar Thomas Aquinas referenced Aristotle's spherical Earth theory in his works, indicating widespread acceptance among educated individuals.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Thomas Aquinas was an outlier; most medieval scholars relied on biblical interpretations suggesting a flat Earth.",
          "confidence": 0.6,
          "attacks": {
            "A2": 0.65
          }
        },
        {
          "id": "C1",
          "text": "Historical records show that many medieval universities taught Aristotle's spherical Earth theory as standard curriculum.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.8
          }
        },
        {
          "id": "B2",
          "text": "Aristotle's spherical Earth theory was often rejected by the Church, which held significant influence over medieval scholarship.",
          "confidence": 0.7,
          "attacks": {
            "A2": 0.7
          }
        },
        {
          "id": "C2",
          "text": "The Church's opposition to Aristotle was primarily theological, not scientific, and many clergy members accepted a spherical Earth.",
          "confidence": 0.78,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    },
    "A3": {
      "supporting": {
        "id": "A3",
        "cate": "P",
        "text": "Medieval maps, such as the T-O maps, were symbolic representations and not literal depictions of a flat Earth, reflecting an understanding of Earth's sphericity."
      },
      "attacks": [
        {
          "id": "A3",
          "text": "Medieval maps, such as the T-O maps, were symbolic representations and not literal depictions of a flat Earth, reflecting an understanding of Earth's sphericity.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some medieval texts explicitly describe the Earth as flat, contradicting the idea that all scholars believed in a spherical Earth.",
          "confidence": 0.7,
          "attacks": {
            "A3": 0.65
          }
        },
        {
          "id": "C1",
          "text": "The flat Earth descriptions in medieval texts were often allegorical or theological, not scientific, and do not represent mainstream scholarly opinion.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.75
          }
        },
        {
          "id": "B2",
          "text": "T-O maps were often interpreted literally by the general populace, suggesting widespread belief in a flat Earth despite scholarly views.",
          "confidence": 0.6,
          "attacks": {
            "A3": 0.55
          }
        },
        {
          "id": "C2",
          "text": "Historical evidence shows that educated elites, including clergy and scholars, consistently taught the Earth's sphericity, distancing themselves from popular misconceptions.",
          "confidence": 0.85,
          "attacks": {
            "B2": 0.8
          }
        }
      ]
    },
    "A4": {
      "supporting": {
        "id": "A4",
        "cate": "P",
        "text": "The concept of antipodes (people living on the opposite side of the Earth) was discussed by medieval scholars, which would only make sense if the Earth were round."
      },
      "attacks": [
        {
          "id": "A4",
          "text": "The concept of antipodes (people living on the opposite side of the Earth) was discussed by medieval scholars, which would only make sense if the Earth were round.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some medieval scholars, like Lactantius, explicitly rejected the idea of a round Earth and antipodes as absurd.",
          "confidence": 0.75,
          "attacks": {
            "A4": 0.65
          }
        },
        {
          "id": "C1",
          "text": "Lactantius was an outlier; most educated medieval scholars accepted the Earth's sphericity based on classical Greek knowledge.",
          "confidence": 0.82,
          "attacks": {
            "B1": 0.8
          }
        },
        {
          "id": "B2",
          "text": "The discussion of antipodes was often theoretical or allegorical, not necessarily proof of widespread belief in a round Earth.",
          "confidence": 0.7,
          "attacks": {
            "A4": 0.6
          }
        },
        {
          "id": "C2",
          "text": "Medieval astronomical and geographical works, like those of Bede and Sacrobosco, explicitly described the Earth as spherical.",
          "confidence": 0.88,
          "attacks": {
            "B2": 0.85
          }
        }
      ]
    },
    "A5": {
      "supporting": {
        "id": "A5",
        "cate": "P",
        "text": "Astronomical observations, such as the curvature of Earth's shadow during lunar eclipses, were cited by medieval scholars as evidence for a spherical Earth."
      },
      "attacks": [
        {
          "id": "A5",
          "text": "Astronomical observations, such as the curvature of Earth's shadow during lunar eclipses, were cited by medieval scholars as evidence for a spherical Earth.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some medieval scholars, like Lactantius and Cosmas Indicopleustes, explicitly argued for a flat Earth based on religious texts.",
          "confidence": 0.65,
          "attacks": {
            "A5": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Lactantius and Cosmas were fringe figures; mainstream medieval scholarship overwhelmingly supported a spherical Earth.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.75
          }
        },
        {
          "id": "B2",
          "text": "The curvature of Earth's shadow could also be explained by a disk-shaped Earth, not necessarily a sphere.",
          "confidence": 0.5,
          "attacks": {
            "A5": 0.45
          }
        },
        {
          "id": "C2",
          "text": "A disk-shaped Earth would not produce a consistently circular shadow during lunar eclipses from different vantage points.",
          "confidence": 0.75,
          "attacks": {
            "B2": 0.7
          }
        }
      ]
    },
    "A6": {
      "supporting": {
        "id": "A6",
        "cate": "P",
        "text": "The Venerable Bede, an early medieval scholar, explicitly described the Earth as round in his writings, demonstrating knowledge of its shape."
      },
      "attacks": [
        {
          "id": "A6",
          "text": "The Venerable Bede, an early medieval scholar, explicitly described the Earth as round in his writings, demonstrating knowledge of its shape.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Bede's writings were not widely read or influential outside monastic circles, limiting their impact on broader medieval scholarship.",
          "confidence": 0.65,
          "attacks": {
            "A6": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Despite limited circulation, Bede's works were copied and preserved in monastic libraries, ensuring some scholarly continuity.",
          "confidence": 0.7,
          "attacks": {
            "B1": 0.75
          }
        },
        {
          "id": "B2",
          "text": "Some early medieval maps like the T-O maps depicted a flat Earth, contradicting Bede's round Earth description.",
          "confidence": 0.6,
          "attacks": {
            "A6": 0.55
          }
        },
        {
          "id": "C2",
          "text": "T-O maps were schematic representations for religious purposes, not literal geographical depictions.",
          "confidence": 0.8,
          "attacks": {
            "B2": 0.85
          }
        }
      ]
    }
  }
}