{
  "claim": "If you stand close to a microwave, you will get cancer.",
  "Args": {
    "A1": {
      "supporting": {
        "id": "A1",
        "cate": "S",
        "text": "Microwaves emit non-ionizing radiation, which lacks sufficient energy to damage DNA or cause cancer, as confirmed by the World Health Organization."
      },
      "attacks": [
        {
          "id": "A1",
          "text": "Microwaves emit non-ionizing radiation, which lacks sufficient energy to damage DNA or cause cancer, as confirmed by the World Health Organization.",
          "cate": "P",
          "confidence": 0.92,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "While non-ionizing radiation doesn't damage DNA directly, prolonged exposure to high levels may still have biological effects, as suggested by some studies on electromagnetic fields.",
          "confidence": 0.65,
          "attacks": {
            "A1": 0.55
          }
        },
        {
          "id": "C1",
          "text": "The studies suggesting biological effects from non-ionizing radiation are often inconclusive or lack rigorous peer-reviewed validation, as noted by the FDA and other regulatory bodies.",
          "confidence": 0.85,
          "attacks": {
            "B1": 0.8
          }
        },
        {
          "id": "B2",
          "text": "Microwave ovens can leak radiation if damaged or improperly maintained, potentially exposing users to higher levels than officially deemed safe.",
          "confidence": 0.6,
          "attacks": {
            "A1": 0.5
          }
        },
        {
          "id": "C2",
          "text": "Modern microwave ovens are required to meet strict safety standards, with leakage limits far below levels considered hazardous, as enforced by agencies like the FCC.",
          "confidence": 0.88,
          "attacks": {
            "B2": 0.85
          }
        }
      ]
    },
    "A2": {
      "supporting": {
        "id": "A2",
        "cate": "S",
        "text": "The FDA regulates microwave ovens to ensure radiation leakage is well below levels known to harm humans, making cancer risk negligible."
      },
      "attacks": [
        {
          "id": "A2",
          "text": "The FDA regulates microwave ovens to ensure radiation leakage is well below levels known to harm humans, making cancer risk negligible.",
          "cate": "S",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some studies suggest long-term exposure to low-level microwave radiation may still pose health risks, including potential cancer links.",
          "confidence": 0.6,
          "attacks": {
            "A2": 0.65
          }
        },
        {
          "id": "C1",
          "text": "The FDA's safety standards are based on outdated research and may not account for cumulative exposure effects over decades.",
          "confidence": 0.55,
          "attacks": {
            "B1": 0.7
          }
        },
        {
          "id": "D1",
          "text": "Independent testing consistently shows microwave radiation levels are thousands of times below harmful thresholds even after years of use.",
          "confidence": 0.8,
          "attacks": {
            "C1": 0.85
          }
        },
        {
          "id": "B2",
          "text": "Microwave ovens can malfunction or become damaged, potentially leaking higher radiation levels than FDA limits.",
          "confidence": 0.5,
          "attacks": {
            "A2": 0.6
          }
        },
        {
          "id": "C2",
          "text": "Modern microwaves have multiple fail-safes that automatically shut down the device if any radiation leakage is detected.",
          "confidence": 0.75,
          "attacks": {
            "B2": 0.8
          }
        }
      ]
    },
    "A3": {
      "supporting": {
        "id": "A3",
        "cate": "S",
        "text": "Scientific studies have found no credible evidence linking microwave radiation exposure to cancer in humans."
      },
      "attacks": [
        {
          "id": "A3",
          "text": "Scientific studies have found no credible evidence linking microwave radiation exposure to cancer in humans.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some studies suggest that prolonged exposure to high levels of microwave radiation may increase cancer risk.",
          "confidence": 0.6,
          "attacks": {
            "A3": 0.65
          }
        },
        {
          "id": "C1",
          "text": "The studies suggesting cancer risk from microwave radiation are often based on animal models or extreme exposure levels not typical for household microwaves.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.8
          }
        },
        {
          "id": "B2",
          "text": "The World Health Organization classifies microwave radiation as a possible carcinogen, indicating some level of risk.",
          "confidence": 0.7,
          "attacks": {
            "A3": 0.7
          }
        },
        {
          "id": "C2",
          "text": "The WHO's classification is based on limited evidence and does not specifically link typical microwave oven usage to cancer.",
          "confidence": 0.8,
          "attacks": {
            "B2": 0.85
          }
        }
      ]
    },
    "A4": {
      "supporting": {
        "id": "A4",
        "cate": "S",
        "text": "The shielding in microwave ovens is designed to contain radiation, and standing nearby does not expose the body to harmful levels."
      },
      "attacks": [
        {
          "id": "A4",
          "text": "The shielding in microwave ovens is designed to contain radiation, and standing nearby does not expose the body to harmful levels.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Microwave oven shielding can degrade over time, leading to potential leakage of radiation.",
          "confidence": 0.65,
          "attacks": {
            "A4": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Regular safety inspections and standards ensure that microwave ovens maintain their shielding integrity over time.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.8
          }
        },
        {
          "id": "B2",
          "text": "Even with shielding, prolonged exposure to microwaves at close range may have cumulative health effects.",
          "confidence": 0.55,
          "attacks": {
            "A4": 0.5
          }
        },
        {
          "id": "C2",
          "text": "Scientific studies have not found conclusive evidence linking microwave radiation at typical exposure levels to cancer.",
          "confidence": 0.8,
          "attacks": {
            "B2": 0.85
          }
        }
      ]
    },
    "A5": {
      "supporting": {
        "id": "A5",
        "cate": "S",
        "text": "Non-ionizing radiation from microwaves does not accumulate in the body, unlike ionizing radiation (e.g., X-rays), which is known to increase cancer risk."
      },
      "attacks": [
        {
          "id": "A5",
          "text": "Non-ionizing radiation from microwaves does not accumulate in the body, unlike ionizing radiation (e.g., X-rays), which is known to increase cancer risk.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Prolonged exposure to non-ionizing radiation at high intensities may still cause cellular damage, though not as severe as ionizing radiation.",
          "confidence": 0.65,
          "attacks": {
            "A5": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Microwave ovens are designed with safety standards that limit radiation leakage to levels far below those known to cause harm.",
          "confidence": 0.9,
          "attacks": {
            "B1": 0.85
          }
        },
        {
          "id": "B2",
          "text": "Some studies suggest a possible link between non-ionizing radiation and certain types of cancer, though evidence is inconclusive.",
          "confidence": 0.55,
          "attacks": {
            "A5": 0.5
          }
        },
        {
          "id": "C2",
          "text": "The majority of peer-reviewed studies find no consistent evidence linking microwave radiation to cancer in humans.",
          "confidence": 0.88,
          "attacks": {
            "B2": 0.8
          }
        }
      ]
    }
  }
}