{
  "claim": "Archaeologists spend most of their time excavating historical sites.",
  "Args": {
    "A1": {
      "supporting": {
        "id": "A1",
        "cate": "P",
        "text": "Excavation is a fundamental part of archaeological fieldwork, as it allows researchers to uncover and study artifacts and structures directly."
      },
      "attacks": [
        {
          "id": "A1",
          "text": "Excavation is a fundamental part of archaeological fieldwork, as it allows researchers to uncover and study artifacts and structures directly.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Modern archaeologists spend significant time on lab analysis, documentation, and preservation, not just excavation.",
          "confidence": 0.8,
          "attacks": {
            "A1": 0.75
          }
        },
        {
          "id": "B2",
          "text": "Many archaeological projects focus on surveying or non-invasive techniques like ground-penetrating radar rather than excavation.",
          "confidence": 0.78,
          "attacks": {
            "A1": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Even when excavation occurs, it often represents less than 30% of total project time due to permit processes and post-excavation work.",
          "confidence": 0.82,
          "attacks": {
            "B1": 0.6,
            "B2": 0.5
          }
        },
        {
          "id": "D1",
          "text": "Some high-profile excavations (e.g., Pompeii) do dominate researchers' careers for decades.",
          "confidence": 0.65,
          "attacks": {
            "C1": 0.45
          }
        }
      ]
    },
    "A2": {
      "supporting": {
        "id": "A2",
        "cate": "S",
        "text": "Archaeologists spend significant time on lab work, analyzing artifacts, and writing reports, which often takes more time than excavation itself."
      },
      "attacks": [
        {
          "id": "A2",
          "text": "Archaeologists spend significant time on lab work, analyzing artifacts, and writing reports, which often takes more time than excavation itself.",
          "cate": "S",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Excavation is the most visible and resource-intensive part of archaeology, often requiring months or years of fieldwork.",
          "confidence": 0.75,
          "attacks": {
            "A2": 0.7
          }
        },
        {
          "id": "C1",
          "text": "While excavation is time-consuming, post-excavation analysis and reporting can take even longer due to the meticulous nature of artifact preservation and documentation.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.75
          }
        },
        {
          "id": "D1",
          "text": "Some archaeological projects focus on re-examining existing collections, requiring little to no excavation time at all.",
          "confidence": 0.65,
          "attacks": {
            "B1": 0.6
          }
        }
      ]
    },
    "A3": {
      "supporting": {
        "id": "A3",
        "cate": "P",
        "text": "Field seasons are often dedicated to excavation, which can last for months, making it a major time commitment for archaeologists."
      },
      "attacks": [
        {
          "id": "A3",
          "text": "Field seasons are often dedicated to excavation, which can last for months, making it a major time commitment for archaeologists.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Excavation is only one phase of archaeological work; post-excavation analysis, lab work, and report writing often take longer than the excavation itself.",
          "confidence": 0.8,
          "attacks": {
            "A3": 0.85
          }
        },
        {
          "id": "C1",
          "text": "Many archaeologists specialize in non-excavation roles like archival research, remote sensing, or conservation, which do not involve significant excavation time.",
          "confidence": 0.7,
          "attacks": {
            "B1": 0.6
          }
        },
        {
          "id": "B2",
          "text": "Some archaeological projects focus on survey or documentation rather than excavation, meaning no time is spent digging.",
          "confidence": 0.65,
          "attacks": {
            "A3": 0.7
          }
        },
        {
          "id": "C2",
          "text": "Even in excavation-heavy projects, permits, funding acquisition, and community engagement can dominate the timeline rather than physical digging.",
          "confidence": 0.6,
          "attacks": {
            "B2": 0.5
          }
        }
      ]
    },
    "A4": {
      "supporting": {
        "id": "A4",
        "cate": "S",
        "text": "Many archaeologists work in cultural resource management, which involves surveys and documentation rather than extensive excavation."
      },
      "attacks": [
        {
          "id": "A4",
          "text": "Many archaeologists work in cultural resource management, which involves surveys and documentation rather than extensive excavation.",
          "cate": "S",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Excavation is still a significant part of archaeology, especially in research-oriented projects.",
          "confidence": 0.75,
          "attacks": {
            "A4": 0.65
          }
        },
        {
          "id": "C1",
          "text": "Even in cultural resource management, excavation is often required when surveys identify significant sites.",
          "confidence": 0.7,
          "attacks": {
            "B1": 0.6
          }
        },
        {
          "id": "D1",
          "text": "Many archaeologists specialize in excavation-heavy subfields like classical or biblical archaeology.",
          "confidence": 0.8,
          "attacks": {
            "A4": 0.75
          }
        }
      ]
    },
    "A5": {
      "supporting": {
        "id": "A5",
        "cate": "P",
        "text": "Excavation is a highly visible and resource-intensive activity, often requiring permits and logistics that dominate an archaeologist's schedule during fieldwork."
      },
      "attacks": [
        {
          "id": "A5",
          "text": "Excavation is a highly visible and resource-intensive activity, often requiring permits and logistics that dominate an archaeologist's schedule during fieldwork.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Many archaeologists spend significant time on lab work, analysis, and documentation post-excavation, which can take years compared to the shorter excavation phase.",
          "confidence": 0.8,
          "attacks": {
            "A5": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Fieldwork seasons are often limited to specific times of the year due to weather or funding constraints, reducing the total time spent excavating annually.",
          "confidence": 0.85,
          "attacks": {
            "A5": 0.65
          }
        },
        {
          "id": "B2",
          "text": "Some archaeologists specialize in non-excavation work like archival research or digital reconstruction, which requires no excavation time.",
          "confidence": 0.7,
          "attacks": {
            "A5": 0.6
          }
        },
        {
          "id": "C2",
          "text": "Permit acquisition and logistics are often handled by administrative staff or project managers, not the archaeologists themselves.",
          "confidence": 0.6,
          "attacks": {
            "A5": 0.5
          }
        }
      ]
    },
    "A6": {
      "supporting": {
        "id": "A6",
        "cate": "S",
        "text": "Academic archaeologists spend considerable time teaching, publishing, and applying for grants, reducing the time available for excavation."
      },
      "attacks": [
        {
          "id": "A6",
          "text": "Academic archaeologists spend considerable time teaching, publishing, and applying for grants, reducing the time available for excavation.",
          "cate": "S",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Field archaeologists, who are not in academia, spend the majority of their time excavating sites.",
          "confidence": 0.75,
          "attacks": {
            "A6": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Even academic archaeologists often conduct fieldwork during summers or sabbaticals, balancing teaching and excavation.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.6
          }
        },
        {
          "id": "D1",
          "text": "Funding for excavations is often tied to academic output like publications, forcing academic archaeologists to prioritize non-excavation work.",
          "confidence": 0.78,
          "attacks": {
            "C1": 0.65
          }
        }
      ]
    }
  }
}