{
  "claim": "The original US constitution was written on parchment.",
  "Args": {
    "A1": {
      "supporting": {
        "id": "A1",
        "cate": "P",
        "text": "The original US Constitution is preserved in the National Archives, and historical records confirm it was written on parchment."
      },
      "attacks": [
        {
          "id": "A1",
          "text": "The original US Constitution is preserved in the National Archives, and historical records confirm it was written on parchment.",
          "cate": "P",
          "confidence": 0.95,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some historical documents from the same era were written on vellum, not parchment, and there is debate over the exact material used for the original Constitution.",
          "confidence": 0.65,
          "attacks": {
            "A1": 0.6
          }
        },
        {
          "id": "C1",
          "text": "The National Archives explicitly states that the original Constitution is written on parchment, and vellum was not commonly used for such documents in the US at that time.",
          "confidence": 0.85,
          "attacks": {
            "B1": 0.8
          }
        },
        {
          "id": "B2",
          "text": "The term 'parchment' is sometimes used loosely to refer to any animal-skin writing material, which could include vellum, creating ambiguity in historical records.",
          "confidence": 0.55,
          "attacks": {
            "A1": 0.5
          }
        },
        {
          "id": "C2",
          "text": "Expert analysis and scientific testing confirm that the original Constitution is specifically on parchment, not vellum, as the two materials have distinct properties.",
          "confidence": 0.9,
          "attacks": {
            "B2": 0.85
          }
        }
      ]
    },
    "A2": {
      "supporting": {
        "id": "A2",
        "cate": "P",
        "text": "Parchment was the standard material for important legal documents in the 18th century due to its durability and longevity."
      },
      "attacks": [
        {
          "id": "A2",
          "text": "Parchment was the standard material for important legal documents in the 18th century due to its durability and longevity.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some important 18th-century documents were written on vellum, which is distinct from parchment.",
          "confidence": 0.65,
          "attacks": {
            "A2": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Vellum is actually a type of parchment, specifically made from calfskin, so the distinction doesn't undermine the original argument.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.75
          }
        },
        {
          "id": "B2",
          "text": "The Declaration of Independence was written on paper, showing parchment wasn't universally used for all important documents.",
          "confidence": 0.7,
          "attacks": {
            "A2": 0.55
          }
        },
        {
          "id": "C2",
          "text": "The Declaration was a working document, while the Constitution was meant to be permanent, explaining the different material choices.",
          "confidence": 0.85,
          "attacks": {
            "B2": 0.8
          }
        },
        {
          "id": "B3",
          "text": "Modern analysis shows the Constitution's ink has degraded significantly, questioning parchment's supposed durability.",
          "confidence": 0.6,
          "attacks": {
            "A2": 0.5
          }
        },
        {
          "id": "C3",
          "text": "The degradation is primarily due to poor storage conditions in the 19th century, not inherent flaws in parchment.",
          "confidence": 0.75,
          "attacks": {
            "B3": 0.7
          }
        }
      ]
    },
    "A3": {
      "supporting": {
        "id": "A3",
        "cate": "P",
        "text": "The physical appearance of the original Constitution, including its texture and aging, matches the characteristics of parchment."
      },
      "attacks": [
        {
          "id": "A3",
          "text": "The physical appearance of the original Constitution, including its texture and aging, matches the characteristics of parchment.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "The original Constitution could have been written on high-quality paper designed to mimic parchment, as was common for important documents in the 18th century.",
          "confidence": 0.65,
          "attacks": {
            "A3": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Historical records from the National Archives confirm that the original Constitution was indeed written on parchment, not paper.",
          "confidence": 0.9,
          "attacks": {
            "B1": 0.85
          }
        },
        {
          "id": "B2",
          "text": "The aging process of parchment and high-quality paper can be very similar, making visual and tactile identification unreliable without scientific testing.",
          "confidence": 0.7,
          "attacks": {
            "A3": 0.75
          }
        },
        {
          "id": "C2",
          "text": "Scientific analysis, including microscopic examination and material testing, has confirmed that the original Constitution is on animal-skin parchment.",
          "confidence": 0.95,
          "attacks": {
            "B2": 0.9
          }
        }
      ]
    },
    "A4": {
      "supporting": {
        "id": "A4",
        "cate": "P",
        "text": "Historical accounts from the Constitutional Convention in 1787 mention the use of parchment for the final document."
      },
      "attacks": [
        {
          "id": "A4",
          "text": "Historical accounts from the Constitutional Convention in 1787 mention the use of parchment for the final document.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some historians argue that early drafts of the Constitution may have been written on paper before being transcribed onto parchment.",
          "confidence": 0.65,
          "attacks": {
            "A4": 0.45
          }
        },
        {
          "id": "C1",
          "text": "The National Archives confirms that the original signed Constitution is on parchment, supporting the claim about the final document.",
          "confidence": 0.95,
          "attacks": {
            "B1": 0.85
          }
        },
        {
          "id": "B2",
          "text": "There is no surviving physical evidence from 1787 that definitively proves the material used during the Convention itself.",
          "confidence": 0.55,
          "attacks": {
            "A4": 0.5
          }
        },
        {
          "id": "C2",
          "text": "Multiple contemporary accounts and letters from delegates reference parchment, making it the most reliable historical evidence available.",
          "confidence": 0.8,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    },
    "A5": {
      "supporting": {
        "id": "A5",
        "cate": "P",
        "text": "The National Archives' official documentation describes the Constitution as being written on parchment, which aligns with historical practices of the time."
      },
      "attacks": [
        {
          "id": "A5",
          "text": "The National Archives' official documentation describes the Constitution as being written on parchment, which aligns with historical practices of the time.",
          "cate": "P",
          "confidence": 0.95,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some historians argue that early drafts of the Constitution may have been written on paper before being transcribed onto parchment for the final version.",
          "confidence": 0.65,
          "attacks": {
            "A5": 0.6
          }
        },
        {
          "id": "C1",
          "text": "The National Archives' documentation specifically refers to the final, signed version as being on parchment, which does not contradict the existence of paper drafts.",
          "confidence": 0.85,
          "attacks": {
            "B1": 0.8
          }
        },
        {
          "id": "B2",
          "text": "The term 'parchment' is sometimes used loosely in historical documents and could refer to high-quality paper rather than true animal-skin parchment.",
          "confidence": 0.55,
          "attacks": {
            "A5": 0.5
          }
        },
        {
          "id": "C2",
          "text": "Material analysis conducted by the National Archives confirms the Constitution is written on animal-skin parchment, not paper.",
          "confidence": 0.9,
          "attacks": {
            "B2": 0.85
          }
        }
      ]
    }
  }
}