{
  "claim": "The government lies about UFOs being alien ships because they are controlled by aliens.",
  "Args": {
    "A1": {
      "supporting": {
        "id": "A1",
        "cate": "S",
        "text": "There is no verifiable evidence from credible scientific sources that aliens control UFOs or that governments are hiding such information."
      },
      "attacks": [
        {
          "id": "A1",
          "text": "There is no verifiable evidence from credible scientific sources that aliens control UFOs or that governments are hiding such information.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Governments have declassified UFO footage and reports, suggesting they are not hiding information about alien-controlled UFOs.",
          "confidence": 0.75,
          "attacks": {
            "A1": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Declassified footage does not necessarily mean full transparency; governments may still withhold critical information about UFO origins.",
          "confidence": 0.65,
          "attacks": {
            "B1": 0.6
          }
        },
        {
          "id": "B2",
          "text": "The lack of verifiable evidence does not disprove the claim; absence of evidence is not evidence of absence.",
          "confidence": 0.6,
          "attacks": {
            "A1": 0.55
          }
        },
        {
          "id": "C2",
          "text": "Scientific consensus requires positive evidence, not just the absence of disproof; extraordinary claims require extraordinary evidence.",
          "confidence": 0.8,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    },
    "A2": {
      "supporting": {
        "id": "A2",
        "cate": "S",
        "text": "Governments have historically declassified UFO-related documents, showing transparency rather than concealment of alien control."
      },
      "attacks": [
        {
          "id": "A2",
          "text": "Governments have historically declassified UFO-related documents, showing transparency rather than concealment of alien control.",
          "cate": "P",
          "confidence": 0.65,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Declassified documents often contain heavy redactions, suggesting continued concealment of critical information.",
          "confidence": 0.7,
          "attacks": {
            "A2": 0.75
          }
        },
        {
          "id": "C1",
          "text": "Redactions are standard for protecting national security and personal privacy, not necessarily alien-related secrets.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.85
          }
        },
        {
          "id": "B2",
          "text": "Many declassified UFO documents describe phenomena that remain unexplained, leaving room for alien involvement.",
          "confidence": 0.6,
          "attacks": {
            "A2": 0.65
          }
        },
        {
          "id": "C2",
          "text": "Unexplained phenomena do not inherently imply alien control; natural or human-made explanations are more plausible.",
          "confidence": 0.75,
          "attacks": {
            "B2": 0.8
          }
        }
      ]
    },
    "A3": {
      "supporting": {
        "id": "A3",
        "cate": "S",
        "text": "The scientific consensus is that UFO sightings can be explained by natural phenomena, human-made aircraft, or optical illusions, not alien control."
      },
      "attacks": [
        {
          "id": "A3",
          "text": "The scientific consensus is that UFO sightings can be explained by natural phenomena, human-made aircraft, or optical illusions, not alien control.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some UFO sightings remain unexplained even after rigorous scientific investigation, leaving room for alternative explanations.",
          "confidence": 0.65,
          "attacks": {
            "A3": 0.6
          }
        },
        {
          "id": "C1",
          "text": "The scientific method requires evidence-based conclusions, and lack of explanation does not imply alien control.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.75
          }
        },
        {
          "id": "B2",
          "text": "Government secrecy around UFOs fuels speculation that they may be hiding evidence of alien technology.",
          "confidence": 0.55,
          "attacks": {
            "A3": 0.5
          }
        },
        {
          "id": "C2",
          "text": "Government secrecy is often related to national security concerns rather than extraterrestrial phenomena.",
          "confidence": 0.7,
          "attacks": {
            "B2": 0.7
          }
        }
      ]
    },
    "A4": {
      "supporting": {
        "id": "A4",
        "cate": "S",
        "text": "Claims of alien-controlled UFOs often rely on anecdotal evidence, which lacks the rigor required for mainstream acceptance."
      },
      "attacks": [
        {
          "id": "A4",
          "text": "Claims of alien-controlled UFOs often rely on anecdotal evidence, which lacks the rigor required for mainstream acceptance.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some UFO sightings have been corroborated by multiple credible witnesses, including trained observers like pilots and military personnel.",
          "confidence": 0.65,
          "attacks": {
            "A4": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Even multiple witness accounts can be unreliable due to psychological factors like mass hysteria or confirmation bias.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.85
          }
        },
        {
          "id": "B2",
          "text": "Governments have declassified documents showing advanced aerial phenomena that defy conventional explanations.",
          "confidence": 0.6,
          "attacks": {
            "A4": 0.65
          }
        },
        {
          "id": "C2",
          "text": "Declassified documents often lack conclusive evidence and may be redacted or misinterpreted.",
          "confidence": 0.7,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    },
    "A5": {
      "supporting": {
        "id": "A5",
        "cate": "S",
        "text": "If governments were controlled by aliens, there would likely be more consistent and observable patterns in policy or technology, which are absent."
      },
      "attacks": [
        {
          "id": "A5",
          "text": "If governments were controlled by aliens, there would likely be more consistent and observable patterns in policy or technology, which are absent.",
          "cate": "S",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Governments could be controlled by aliens in subtle ways that avoid detection, explaining the lack of observable patterns.",
          "confidence": 0.6,
          "attacks": {
            "A5": 0.65
          }
        },
        {
          "id": "C1",
          "text": "Subtle control would still leave traces, such as unexplained technological advancements or policy shifts without clear human rationale.",
          "confidence": 0.7,
          "attacks": {
            "B1": 0.75
          }
        },
        {
          "id": "D1",
          "text": "Human innovation and political complexity can account for most unexplained advancements or shifts, reducing the need for alien involvement.",
          "confidence": 0.8,
          "attacks": {
            "C1": 0.85
          }
        }
      ]
    },
    "A6": {
      "supporting": {
        "id": "A6",
        "cate": "S",
        "text": "Independent investigations by reputable organizations have found no proof of alien involvement in UFO phenomena."
      },
      "attacks": [
        {
          "id": "A6",
          "text": "Independent investigations by reputable organizations have found no proof of alien involvement in UFO phenomena.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some government documents declassified in recent years contain redacted sections about UFOs, suggesting possible concealment of alien evidence.",
          "confidence": 0.65,
          "attacks": {
            "A6": 0.6
          }
        },
        {
          "id": "C1",
          "text": "The redactions in UFO documents are standard procedure for protecting national security secrets unrelated to aliens.",
          "confidence": 0.78,
          "attacks": {
            "B1": 0.8
          }
        },
        {
          "id": "B2",
          "text": "Eyewitness testimonies from military pilots describe UFO behaviors that defy known human technology.",
          "confidence": 0.7,
          "attacks": {
            "A6": 0.55
          }
        },
        {
          "id": "C2",
          "text": "Perceptual errors and sensor malfunctions are common explanations for unusual aerial sightings by pilots.",
          "confidence": 0.82,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    }
  }
}