{
  "claim": "Americans earn less  than people in certain countries.",
  "Args": {
    "A1": {
      "supporting": {
        "id": "A1",
        "cate": "P",
        "text": "According to OECD data, the median household income in the United States is lower than in countries like Switzerland and Luxembourg, where wages are significantly higher due to strong economies and high living standards."
      },
      "attacks": [
        {
          "id": "A1",
          "text": "According to OECD data, the median household income in the United States is lower than in countries like Switzerland and Luxembourg, where wages are significantly higher due to strong economies and high living standards.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "The OECD data does not account for differences in cost of living, which is much higher in Switzerland and Luxembourg compared to the United States.",
          "confidence": 0.75,
          "attacks": {
            "A1": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Even after adjusting for purchasing power parity (PPP), median disposable income in the U.S. remains lower than in Switzerland and Luxembourg.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.85
          }
        },
        {
          "id": "B2",
          "text": "The OECD median household income comparison does not include non-cash benefits like employer-provided healthcare, which are more common in the U.S. than in Europe.",
          "confidence": 0.7,
          "attacks": {
            "A1": 0.65
          }
        },
        {
          "id": "C2",
          "text": "Studies show that even when including employer benefits, total compensation in the U.S. still lags behind Switzerland and Luxembourg.",
          "confidence": 0.78,
          "attacks": {
            "B2": 0.8
          }
        },
        {
          "id": "B3",
          "text": "The comparison only looks at a few high-income countries and ignores that Americans earn more than the vast majority of the world's population.",
          "confidence": 0.6,
          "attacks": {
            "A1": 0.55
          }
        }
      ]
    },
    "A2": {
      "supporting": {
        "id": "A2",
        "cate": "P",
        "text": "In Scandinavian countries such as Norway and Denmark, average wages are higher than in the U.S. when adjusted for purchasing power parity, reflecting stronger social welfare systems and labor protections."
      },
      "attacks": [
        {
          "id": "A2",
          "text": "In Scandinavian countries such as Norway and Denmark, average wages are higher than in the U.S. when adjusted for purchasing power parity, reflecting stronger social welfare systems and labor protections.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "The cost of living in Scandinavian countries is significantly higher than in the U.S., which offsets the higher nominal wages when adjusted for purchasing power parity.",
          "confidence": 0.75,
          "attacks": {
            "A2": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Even after accounting for higher costs, disposable income in Scandinavian countries often remains higher due to comprehensive social services reducing out-of-pocket expenses.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.85
          }
        },
        {
          "id": "B2",
          "text": "U.S. wages vary widely by state and sector, with some high-paying industries (e.g., tech) surpassing Scandinavian averages.",
          "confidence": 0.7,
          "attacks": {
            "A2": 0.65
          }
        },
        {
          "id": "C2",
          "text": "Scandinavian wage distributions are more equitable, whereas U.S. high earners skew the average upward, masking lower median wages.",
          "confidence": 0.78,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    },
    "A3": {
      "supporting": {
        "id": "A3",
        "cate": "P",
        "text": "Countries with smaller populations and high GDP per capita, like Qatar and Singapore, often report higher average earnings than the U.S. due to concentrated wealth and specialized economies."
      },
      "attacks": [
        {
          "id": "A3",
          "text": "Countries with smaller populations and high GDP per capita, like Qatar and Singapore, often report higher average earnings than the U.S. due to concentrated wealth and specialized economies.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Average earnings can be misleading because they don't account for income inequality; the median income in the U.S. might still be higher than in Qatar or Singapore.",
          "confidence": 0.75,
          "attacks": {
            "A3": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Qatar and Singapore have unique economic structures (e.g., oil wealth, city-state status) that are not comparable to larger, more diverse economies like the U.S.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.65
          }
        },
        {
          "id": "B2",
          "text": "The cost of living in Qatar and Singapore is significantly higher than in most U.S. cities, which offsets the higher nominal earnings.",
          "confidence": 0.78,
          "attacks": {
            "A3": 0.72
          }
        },
        {
          "id": "C2",
          "text": "Purchasing power parity (PPP) adjustments show that U.S. earnings often go further than those in Qatar or Singapore when cost of living is factored in.",
          "confidence": 0.82,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    },
    "A4": {
      "supporting": {
        "id": "A4",
        "cate": "P",
        "text": "Germany and Australia have higher minimum wages and more progressive labor policies, leading to higher earnings for low- and middle-income workers compared to their American counterparts."
      },
      "attacks": [
        {
          "id": "A4",
          "text": "Germany and Australia have higher minimum wages and more progressive labor policies, leading to higher earnings for low- and middle-income workers compared to their American counterparts.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "The cost of living in Germany and Australia is significantly higher than in the US, which offsets the higher nominal wages.",
          "confidence": 0.75,
          "attacks": {
            "A4": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Even accounting for cost of living, purchasing power parity-adjusted wages in Germany and Australia are still higher for many workers.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.85
          }
        },
        {
          "id": "B2",
          "text": "The US has higher earnings potential for high-skilled workers in sectors like tech and finance, which skews average earnings upward.",
          "confidence": 0.7,
          "attacks": {
            "A4": 0.65
          }
        },
        {
          "id": "C2",
          "text": "The original argument specifically addresses low- and middle-income workers, not high-skilled sectors.",
          "confidence": 0.9,
          "attacks": {
            "B2": 0.95
          }
        },
        {
          "id": "B3",
          "text": "Some US states like California and New York have minimum wages comparable to or higher than those in Germany and Australia when adjusted for local purchasing power.",
          "confidence": 0.6,
          "attacks": {
            "A4": 0.55
          }
        },
        {
          "id": "C3",
          "text": "These states are exceptions rather than the norm, and their high costs of living still make the comparison unfavorable for many workers.",
          "confidence": 0.75,
          "attacks": {
            "B3": 0.8
          }
        }
      ]
    },
    "A5": {
      "supporting": {
        "id": "A5",
        "cate": "P",
        "text": "In nations with strong labor unions, such as Sweden and Belgium, collective bargaining ensures higher wages for workers in many sectors compared to the U.S., where unionization rates are lower."
      },
      "attacks": [
        {
          "id": "A5",
          "text": "In nations with strong labor unions, such as Sweden and Belgium, collective bargaining ensures higher wages for workers in many sectors compared to the U.S., where unionization rates are lower.",
          "cate": "P",
          "confidence": 0.82,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "The cost of living in Sweden and Belgium is significantly higher than in the U.S., which offsets the higher nominal wages.",
          "confidence": 0.75,
          "attacks": {
            "A5": 0.7
          }
        },
        {
          "id": "B2",
          "text": "Unionization rates alone do not account for wage differences; productivity, industry mix, and economic policies play larger roles.",
          "confidence": 0.78,
          "attacks": {
            "A5": 0.8
          }
        },
        {
          "id": "C1",
          "text": "Even after adjusting for cost of living, disposable income in some high-unionization countries remains higher than in the U.S.",
          "confidence": 0.7,
          "attacks": {
            "B1": 0.65
          }
        },
        {
          "id": "C2",
          "text": "The U.S. has higher wage inequality, meaning some workers earn far more than in Europe, even if the median is lower.",
          "confidence": 0.68,
          "attacks": {
            "A5": 0.6
          }
        },
        {
          "id": "D1",
          "text": "Disposable income comparisons often exclude non-wage benefits like employer healthcare, which are more prevalent in the U.S.",
          "confidence": 0.72,
          "attacks": {
            "C1": 0.7
          }
        }
      ]
    },
    "A6": {
      "supporting": {
        "id": "A6",
        "cate": "P",
        "text": "Certain tax policies in countries like Canada and the Netherlands redistribute wealth more effectively, resulting in higher net incomes for middle-class citizens relative to the U.S."
      },
      "attacks": [
        {
          "id": "A6",
          "text": "Certain tax policies in countries like Canada and the Netherlands redistribute wealth more effectively, resulting in higher net incomes for middle-class citizens relative to the U.S.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "The U.S. has a higher GDP per capita than Canada and the Netherlands, suggesting higher pre-tax incomes that may offset the impact of redistribution.",
          "confidence": 0.7,
          "attacks": {
            "A6": 0.65
          }
        },
        {
          "id": "B2",
          "text": "Cost of living in Canada and the Netherlands is significantly higher than in many parts of the U.S., which may negate the advantage of higher net incomes.",
          "confidence": 0.68,
          "attacks": {
            "A6": 0.6
          }
        },
        {
          "id": "C1",
          "text": "While GDP per capita is higher in the U.S., income inequality is also more pronounced, meaning the median income may still be lower than in countries with better redistribution.",
          "confidence": 0.72,
          "attacks": {
            "B1": 0.7
          }
        },
        {
          "id": "C2",
          "text": "Studies show that higher taxes in countries like Canada and the Netherlands fund public services (e.g., healthcare, education), reducing out-of-pocket expenses and improving net disposable income.",
          "confidence": 0.8,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    }
  }
}