{
  "claim": "Bangkok gets more international arrivals than Paris.",
  "Args": {
    "A1": {
      "supporting": {
        "id": "A1",
        "cate": "P",
        "text": "Bangkok is a major hub for tourism in Southeast Asia, attracting millions of visitors annually due to its affordability, cultural landmarks, and vibrant street life."
      },
      "attacks": [
        {
          "id": "A1",
          "text": "Bangkok is a major hub for tourism in Southeast Asia, attracting millions of visitors annually due to its affordability, cultural landmarks, and vibrant street life.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Paris remains the most visited city in the world, with over 38 million international tourists annually, according to recent global tourism reports.",
          "confidence": 0.9,
          "attacks": {
            "A1": 0.8
          }
        },
        {
          "id": "C1",
          "text": "The data for Bangkok includes domestic tourists, which inflates its visitor numbers compared to Paris, where international arrivals are distinctly tracked.",
          "confidence": 0.75,
          "attacks": {
            "A1": 0.7
          }
        },
        {
          "id": "B2",
          "text": "Bangkok's affordability attracts budget travelers, but Paris attracts higher-spending tourists, making its economic impact per visitor significantly greater.",
          "confidence": 0.7,
          "attacks": {
            "A1": 0.6
          }
        },
        {
          "id": "C2",
          "text": "Bangkok's cultural landmarks, like the Grand Palace, are concentrated in a smaller area, leading to higher perceived density of attractions compared to Paris.",
          "confidence": 0.65,
          "attacks": {
            "B2": 0.5
          }
        }
      ]
    },
    "A2": {
      "supporting": {
        "id": "A2",
        "cate": "P",
        "text": "Thailand's tourism industry heavily promotes Bangkok as a gateway to the country, with extensive flight connections and visa-on-arrival policies facilitating international arrivals."
      },
      "attacks": [
        {
          "id": "A2",
          "text": "Thailand's tourism industry heavily promotes Bangkok as a gateway to the country, with extensive flight connections and visa-on-arrival policies facilitating international arrivals.",
          "cate": "P",
          "confidence": 0.82,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Paris remains a global cultural and historical hub, attracting visitors regardless of promotional efforts, with consistently high arrivals from Europe and North America.",
          "confidence": 0.78,
          "attacks": {
            "A2": 0.65
          }
        },
        {
          "id": "C1",
          "text": "Bangkok's visa-on-arrival policies primarily benefit short-term visitors from specific regions, while Paris attracts long-term tourists from a more diverse global demographic.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.6
          }
        },
        {
          "id": "B2",
          "text": "Thailand's political instability and safety concerns in recent years have deterred some international tourists, reducing Bangkok's arrivals compared to Paris.",
          "confidence": 0.68,
          "attacks": {
            "A2": 0.7
          }
        },
        {
          "id": "C2",
          "text": "Paris has faced its own challenges with safety and protests, which have periodically impacted its tourism numbers.",
          "confidence": 0.72,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    },
    "A3": {
      "supporting": {
        "id": "A3",
        "cate": "P",
        "text": "Bangkok's Suvarnabhumi Airport consistently ranks among the busiest airports in the world by international passenger traffic, reflecting high visitor numbers."
      },
      "attacks": [
        {
          "id": "A3",
          "text": "Bangkok's Suvarnabhumi Airport consistently ranks among the busiest airports in the world by international passenger traffic, reflecting high visitor numbers.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Paris has two major international airports (Charles de Gaulle and Orly), which collectively handle more international passengers than Suvarnabhumi Airport alone.",
          "confidence": 0.78,
          "attacks": {
            "A3": 0.8
          }
        },
        {
          "id": "C1",
          "text": "Suvarnabhumi Airport's ranking includes transit passengers who do not actually visit Bangkok, inflating the perceived visitor numbers.",
          "confidence": 0.7,
          "attacks": {
            "A3": 0.65
          }
        },
        {
          "id": "D1",
          "text": "Charles de Gaulle Airport also handles significant transit traffic, similarly inflating Paris's visitor numbers.",
          "confidence": 0.6,
          "attacks": {
            "B1": 0.55
          }
        },
        {
          "id": "B2",
          "text": "Tourism surveys show Paris consistently ranks higher than Bangkok in international visitor satisfaction and repeat visits, indicating stronger sustained appeal.",
          "confidence": 0.75,
          "attacks": {
            "A3": 0.7
          }
        },
        {
          "id": "C2",
          "text": "Bangkok's lower cost of travel and accommodation attracts budget-conscious travelers, resulting in higher raw arrival numbers despite Paris's stronger brand appeal.",
          "confidence": 0.68,
          "attacks": {
            "B2": 0.6
          }
        }
      ]
    },
    "A4": {
      "supporting": {
        "id": "A4",
        "cate": "P",
        "text": "The city hosts large-scale events like Songkran (Thai New Year) and Loy Krathong, which draw significant international tourists, boosting annual arrival statistics."
      },
      "attacks": [
        {
          "id": "A4",
          "text": "The city hosts large-scale events like Songkran (Thai New Year) and Loy Krathong, which draw significant international tourists, boosting annual arrival statistics.",
          "cate": "P",
          "confidence": 0.78,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Paris also hosts major international events like Paris Fashion Week and the French Open, which attract comparable or larger numbers of international visitors.",
          "confidence": 0.75,
          "attacks": {
            "A4": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Songkran and Loy Krathong are culturally unique events that attract niche audiences, whereas Paris's events have broader global appeal.",
          "confidence": 0.65,
          "attacks": {
            "B1": 0.6
          }
        },
        {
          "id": "B2",
          "text": "Official tourism statistics show Paris consistently ranks higher than Bangkok in total international arrivals, contradicting the claim.",
          "confidence": 0.85,
          "attacks": {
            "A4": 0.8
          }
        },
        {
          "id": "C2",
          "text": "Bangkok's tourism statistics may be underreported due to informal arrivals (e.g., overland travelers) not captured in official data.",
          "confidence": 0.6,
          "attacks": {
            "B2": 0.55
          }
        }
      ]
    },
    "A5": {
      "supporting": {
        "id": "A5",
        "cate": "P",
        "text": "Bangkok's reputation as a shopping and culinary destination, combined with its nightlife, appeals to a broad range of international travelers, sustaining high visitor numbers."
      },
      "attacks": [
        {
          "id": "A5",
          "text": "Bangkok's reputation as a shopping and culinary destination, combined with its nightlife, appeals to a broad range of international travelers, sustaining high visitor numbers.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Paris is a globally recognized cultural and historical hub, attracting tourists for its museums, landmarks, and art, which may offset Bangkok's advantages in shopping and nightlife.",
          "confidence": 0.82,
          "attacks": {
            "A5": 0.75
          }
        },
        {
          "id": "C1",
          "text": "Bangkok's affordability compared to Paris makes it more accessible to budget travelers, reinforcing its higher visitor numbers despite Paris's cultural appeal.",
          "confidence": 0.78,
          "attacks": {
            "B1": 0.7
          }
        },
        {
          "id": "B2",
          "text": "Geographical proximity to major tourist markets like China and India gives Bangkok a natural advantage in visitor numbers over Paris.",
          "confidence": 0.8,
          "attacks": {
            "A5": 0.65
          }
        },
        {
          "id": "C2",
          "text": "Paris benefits from stronger air connectivity and higher long-haul flight capacity, mitigating Bangkok's geographical advantage.",
          "confidence": 0.75,
          "attacks": {
            "B2": 0.72
          }
        }
      ]
    },
    "A6": {
      "supporting": {
        "id": "A6",
        "cate": "P",
        "text": "Pre-pandemic data from organizations like the World Tourism Organization (UNWTO) showed Bangkok frequently surpassing Paris in international tourist arrivals."
      },
      "attacks": [
        {
          "id": "A6",
          "text": "Pre-pandemic data from organizations like the World Tourism Organization (UNWTO) showed Bangkok frequently surpassing Paris in international tourist arrivals.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Post-pandemic tourism trends show Paris recovering faster than Bangkok, with Paris reclaiming its lead in international arrivals as of 2023 reports.",
          "confidence": 0.78,
          "attacks": {
            "A6": 0.7
          }
        },
        {
          "id": "C1",
          "text": "The UNWTO data cited by A6 is outdated and does not account for recent shifts in travel preferences post-pandemic.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.6
          }
        },
        {
          "id": "B2",
          "text": "Bangkok's arrivals are heavily dependent on regional Asian tourism, which has been slower to recover compared to Paris's diversified global visitor base.",
          "confidence": 0.75,
          "attacks": {
            "A6": 0.65
          }
        },
        {
          "id": "C2",
          "text": "Asian tourism is rebounding faster than projected, with Bangkok seeing a surge in arrivals from China and India in late 2023.",
          "confidence": 0.72,
          "attacks": {
            "B2": 0.7
          }
        }
      ]
    }
  }
}