{
  "claim": "The government lies about UFOs being alien ships because they are controlled by aliens.",
  "Args": {
    "A1": {
      "supporting": {
        "id": "A1",
        "text": "Governments have historically concealed information about UFOs, suggesting a pattern of secrecy that could include hiding alien control.",
        "confidence": 0.65,
        "cate": "P"
      },
      "attacks": [
        {
          "id": "A1",
          "text": "Governments have historically concealed information about UFOs, suggesting a pattern of secrecy that could include hiding alien control.",
          "confidence": 0.65,
          "attacks": [],
          "cate": "P"
        },
        {
          "id": "B1",
          "text": "Secrecy around UFOs is often due to national security concerns rather than alien involvement.",
          "confidence": 0.75,
          "attacks": [
            "A1"
          ]
        },
        {
          "id": "B2",
          "text": "There is no concrete evidence linking UFO sightings to alien control of governments.",
          "confidence": 0.7,
          "attacks": [
            "A1"
          ]
        },
        {
          "id": "C1",
          "text": "Declassified documents show that many UFO cases were misidentified military aircraft.",
          "confidence": 0.8,
          "attacks": [
            "B1"
          ]
        },
        {
          "id": "C2",
          "text": "Historical secrecy does not necessarily imply current concealment of alien control.",
          "confidence": 0.68,
          "attacks": [
            "B1"
          ]
        },
        {
          "id": "C3",
          "text": "Eyewitness accounts and radar data often provide credible explanations for UFO sightings without invoking aliens.",
          "confidence": 0.72,
          "attacks": [
            "B2"
          ]
        },
        {
          "id": "C4",
          "text": "Lack of evidence for alien control is not proof of its absence, but it shifts the burden of proof to those making the claim.",
          "confidence": 0.65,
          "attacks": [
            "B2"
          ]
        }
      ]
    },
    "A2": {
      "supporting": {
        "id": "A2",
        "text": "There is no verifiable evidence that UFOs are controlled by aliens, making the claim speculative.",
        "confidence": 0.85,
        "cate": "S"
      },
      "attacks": [
        {
          "id": "A2",
          "text": "There is no verifiable evidence that UFOs are controlled by aliens, making the claim speculative.",
          "confidence": 0.85,
          "attacks": [],
          "cate": "S"
        },
        {
          "id": "B1",
          "text": "Government documents and whistleblower testimonies suggest deliberate obfuscation of UFO-related information.",
          "confidence": 0.75,
          "attacks": [
            "A2"
          ]
        },
        {
          "id": "B2",
          "text": "The absence of evidence does not equate to evidence of absence; classified programs may conceal alien involvement.",
          "confidence": 0.7,
          "attacks": [
            "A2"
          ]
        },
        {
          "id": "C1",
          "text": "Whistleblower accounts often lack corroborating physical evidence and may be influenced by personal biases.",
          "confidence": 0.68,
          "attacks": [
            "B1"
          ]
        },
        {
          "id": "C2",
          "text": "Classified programs are typically related to national security, not extraterrestrial concealment.",
          "confidence": 0.8,
          "attacks": [
            "B2"
          ]
        }
      ]
    },
    "A3": {
      "supporting": {
        "id": "A3",
        "text": "Government secrecy around UFOs could be for national security reasons unrelated to alien involvement.",
        "confidence": 0.75,
        "cate": "S"
      },
      "attacks": [
        {
          "id": "A3",
          "text": "Government secrecy around UFOs could be for national security reasons unrelated to alien involvement.",
          "confidence": 0.75,
          "attacks": [],
          "cate": "S"
        },
        {
          "id": "B1",
          "text": "Leaked documents and whistleblower testimonies suggest that UFO secrecy is specifically tied to extraterrestrial technology.",
          "confidence": 0.7,
          "attacks": [
            "A3"
          ]
        },
        {
          "id": "B2",
          "text": "Historical cases like Roswell show patterns of cover-ups that align with alien involvement, not just national security.",
          "confidence": 0.68,
          "attacks": [
            "A3"
          ]
        },
        {
          "id": "C1",
          "text": "Many supposed 'leaks' about extraterrestrial technology have been debunked as hoaxes or misinterpretations.",
          "confidence": 0.8,
          "attacks": [
            "B1"
          ]
        },
        {
          "id": "C2",
          "text": "The Roswell incident has been officially explained as a weather balloon, with no credible evidence of alien involvement.",
          "confidence": 0.78,
          "attacks": [
            "B2"
          ]
        },
        {
          "id": "D1",
          "text": "Independent investigations confirm that some UFO-related documents were deliberately altered to mislead the public.",
          "confidence": 0.72,
          "attacks": [
            "C1"
          ]
        },
        {
          "id": "D2",
          "text": "Military personnel involved in Roswell later retracted their claims under pressure, casting doubt on the alien narrative.",
          "confidence": 0.75,
          "attacks": [
            "C2"
          ]
        }
      ]
    },
    "A4": {
      "supporting": {
        "id": "A4",
        "text": "Some whistleblowers and leaked documents hint at advanced technology beyond human capability, indirectly supporting the possibility of alien control.",
        "confidence": 0.6,
        "cate": "P"
      },
      "attacks": [
        {
          "id": "A4",
          "text": "Some whistleblowers and leaked documents hint at advanced technology beyond human capability, indirectly supporting the possibility of alien control.",
          "confidence": 0.6,
          "attacks": [],
          "cate": "P"
        },
        {
          "id": "B1",
          "text": "Whistleblower testimonies are often unreliable and can be influenced by personal biases or misinformation.",
          "confidence": 0.7,
          "attacks": [
            "A4"
          ]
        },
        {
          "id": "B2",
          "text": "Leaked documents can be fabricated or misinterpreted, lacking verifiable evidence of alien technology.",
          "confidence": 0.75,
          "attacks": [
            "A4"
          ]
        },
        {
          "id": "C1",
          "text": "Many whistleblowers have been proven correct in the past, lending credibility to their claims.",
          "confidence": 0.65,
          "attacks": [
            "B1"
          ]
        },
        {
          "id": "C2",
          "text": "Independent experts have verified the authenticity of some leaked documents, increasing their reliability.",
          "confidence": 0.68,
          "attacks": [
            "B2"
          ]
        },
        {
          "id": "D1",
          "text": "Even credible whistleblowers can be mistaken or misled about the nature of advanced technology.",
          "confidence": 0.6,
          "attacks": [
            "C1"
          ]
        },
        {
          "id": "D2",
          "text": "Verification by experts does not necessarily confirm alien origin, only advanced human technology.",
          "confidence": 0.7,
          "attacks": [
            "C2"
          ]
        }
      ]
    },
    "A5": {
      "supporting": {
        "id": "A5",
        "text": "The vast majority of UFO sightings have been debunked as natural phenomena or human-made objects, undermining the claim.",
        "confidence": 0.8,
        "cate": "S"
      },
      "attacks": [
        {
          "id": "A5",
          "text": "The vast majority of UFO sightings have been debunked as natural phenomena or human-made objects, undermining the claim.",
          "confidence": 0.8,
          "attacks": [],
          "cate": "S"
        },
        {
          "id": "B1",
          "text": "Some UFO sightings remain unexplained despite thorough investigation, suggesting they could be of non-human origin.",
          "confidence": 0.7,
          "attacks": [
            "A5"
          ]
        },
        {
          "id": "C1",
          "text": "The lack of definitive evidence for alien involvement in unexplained UFO sightings means they cannot be assumed to be alien ships.",
          "confidence": 0.75,
          "attacks": [
            "B1"
          ]
        },
        {
          "id": "B2",
          "text": "Government secrecy around certain UFO cases fuels suspicion that they may be hiding evidence of alien technology.",
          "confidence": 0.65,
          "attacks": [
            "A5"
          ]
        },
        {
          "id": "C2",
          "text": "Government secrecy is often related to national security concerns rather than extraterrestrial involvement.",
          "confidence": 0.8,
          "attacks": [
            "B2"
          ]
        }
      ]
    },
    "A6": {
      "supporting": {
        "id": "A6",
        "text": "If aliens controlled UFOs, their advanced technology would likely prevent human governments from hiding such a fact effectively.",
        "confidence": 0.7,
        "cate": "S"
      },
      "attacks": [
        {
          "id": "A6",
          "text": "If aliens controlled UFOs, their advanced technology would likely prevent human governments from hiding such a fact effectively.",
          "confidence": 0.7,
          "attacks": [],
          "cate": "S"
        },
        {
          "id": "B1",
          "text": "Governments have historically concealed advanced technologies, such as stealth aircraft, from the public for decades.",
          "confidence": 0.75,
          "attacks": [
            "A6"
          ]
        },
        {
          "id": "B2",
          "text": "Alien technology might include methods to manipulate human perception or memory, making concealment feasible.",
          "confidence": 0.65,
          "attacks": [
            "A6"
          ]
        },
        {
          "id": "C1",
          "text": "Stealth technology was eventually revealed, suggesting that long-term concealment of alien technology is unlikely.",
          "confidence": 0.8,
          "attacks": [
            "B1"
          ]
        },
        {
          "id": "C2",
          "text": "There is no empirical evidence that aliens can manipulate human perception or memory.",
          "confidence": 0.85,
          "attacks": [
            "B2"
          ]
        }
      ]
    }
  }
}