{
  "claim": "Greed is the most prevalent of the Seven Deadly Sins.",
  "Args": {
    "A1": {
      "supporting": {
        "id": "A1",
        "cate": "P",
        "text": "Greed is often cited as a driving force behind economic inequality, which is a widely recognized global issue in 2025."
      },
      "attacks": [
        {
          "id": "A1",
          "text": "Greed is often cited as a driving force behind economic inequality, which is a widely recognized global issue in 2025.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Economic inequality is influenced by systemic factors like tax policies and education access, not just greed.",
          "confidence": 0.75,
          "attacks": {
            "A1": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Greed still plays a significant role in shaping policies that perpetuate inequality.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.75
          }
        },
        {
          "id": "B2",
          "text": "Other sins like pride or envy are more prevalent in social conflicts and personal relationships.",
          "confidence": 0.65,
          "attacks": {
            "A1": 0.6
          }
        },
        {
          "id": "C2",
          "text": "Greed's measurable impact on wealth concentration makes it uniquely systemic compared to other sins.",
          "confidence": 0.78,
          "attacks": {
            "B2": 0.7
          }
        }
      ]
    },
    "A2": {
      "supporting": {
        "id": "A2",
        "cate": "P",
        "text": "Corporate scandals and financial fraud, frequently rooted in greed, are regularly reported in mainstream media, highlighting its prevalence."
      },
      "attacks": [
        {
          "id": "A2",
          "text": "Corporate scandals and financial fraud, frequently rooted in greed, are regularly reported in mainstream media, highlighting its prevalence.",
          "cate": "P",
          "confidence": 0.78,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Many corporate scandals are driven by factors other than greed, such as incompetence, fear of failure, or systemic pressures.",
          "confidence": 0.65,
          "attacks": {
            "A2": 0.6
          }
        },
        {
          "id": "B2",
          "text": "Media reporting bias may exaggerate the prevalence of greed-related scandals because they attract more attention than other sins.",
          "confidence": 0.72,
          "attacks": {
            "A2": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Studies show incompetence accounts for less than 20% of corporate scandals, while greed remains the dominant factor.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.8
          }
        },
        {
          "id": "C2",
          "text": "Even if media has bias, the sheer volume of greed-related scandals compared to other sins supports the original claim.",
          "confidence": 0.68,
          "attacks": {
            "B2": 0.65
          }
        }
      ]
    },
    "A3": {
      "supporting": {
        "id": "A3",
        "cate": "S",
        "text": "Pride is considered by many theologians and philosophers as the root of all sins, making it more fundamental than greed."
      },
      "attacks": [
        {
          "id": "A3",
          "text": "Pride is considered by many theologians and philosophers as the root of all sins, making it more fundamental than greed.",
          "cate": "S",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Greed is more observable and measurable in daily life, making it more prevalent than pride, which is often internalized.",
          "confidence": 0.75,
          "attacks": {
            "A3": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Pride may be the root, but greed manifests more frequently in economic and social behaviors, making it more visible and thus more prevalent.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.65
          }
        },
        {
          "id": "B2",
          "text": "Historical and religious texts often emphasize greed as the primary sin driving societal corruption, suggesting its greater prevalence.",
          "confidence": 0.78,
          "attacks": {
            "A3": 0.8
          }
        },
        {
          "id": "C2",
          "text": "Pride is subjective and culturally variable, whereas greed has a more universal and quantifiable impact across societies.",
          "confidence": 0.72,
          "attacks": {
            "B2": 0.6
          }
        }
      ]
    },
    "A4": {
      "supporting": {
        "id": "A4",
        "cate": "P",
        "text": "Consumer culture, which encourages excessive accumulation of goods, is a clear manifestation of greed in modern society."
      },
      "attacks": [
        {
          "id": "A4",
          "text": "Consumer culture, which encourages excessive accumulation of goods, is a clear manifestation of greed in modern society.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Consumer culture is driven more by necessity and convenience than by greed, as people buy goods to meet basic needs and improve quality of life.",
          "confidence": 0.65,
          "attacks": {
            "A4": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Even if some purchases are for necessity, the advertising industry explicitly exploits human greed to drive overconsumption.",
          "confidence": 0.7,
          "attacks": {
            "B1": 0.75
          }
        },
        {
          "id": "B2",
          "text": "Other sins like pride or envy are more prevalent, as they drive social media behavior and personal conflicts more directly than greed.",
          "confidence": 0.68,
          "attacks": {
            "A4": 0.7
          }
        },
        {
          "id": "C2",
          "text": "Greed underlies economic inequality, which is a more systemic and widespread issue than interpersonal conflicts driven by pride or envy.",
          "confidence": 0.72,
          "attacks": {
            "B2": 0.8
          }
        }
      ]
    },
    "A5": {
      "supporting": {
        "id": "A5",
        "cate": "S",
        "text": "Lust and gluttony are more immediately observable in daily human behavior, making them more visibly prevalent than greed."
      },
      "attacks": [
        {
          "id": "A5",
          "text": "Lust and gluttony are more immediately observable in daily human behavior, making them more visibly prevalent than greed.",
          "cate": "P",
          "confidence": 0.65,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Greed is often less visible but more systemic, driving behaviors like corporate exploitation and wealth hoarding, which affect society broadly.",
          "confidence": 0.75,
          "attacks": {
            "A5": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Lust and gluttony are biologically driven impulses, whereas greed is a socially constructed behavior, making greed more culturally pervasive.",
          "confidence": 0.68,
          "attacks": {
            "B1": 0.6
          }
        },
        {
          "id": "D1",
          "text": "Visibility does not equate to prevalence; greed may be less observable but is more deeply embedded in economic and political systems.",
          "confidence": 0.8,
          "attacks": {
            "A5": 0.85
          }
        }
      ]
    },
    "A6": {
      "supporting": {
        "id": "A6",
        "cate": "P",
        "text": "The pursuit of wealth at the expense of ethical considerations is a common theme in both historical and contemporary narratives."
      },
      "attacks": [
        {
          "id": "A6",
          "text": "The pursuit of wealth at the expense of ethical considerations is a common theme in both historical and contemporary narratives.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Many narratives also emphasize altruism, charity, and ethical wealth accumulation, counterbalancing greed.",
          "confidence": 0.7,
          "attacks": {
            "A6": 0.65
          }
        },
        {
          "id": "C1",
          "text": "Altruistic narratives are often overshadowed by greed-driven ones in media and popular culture, reinforcing greed's visibility.",
          "confidence": 0.68,
          "attacks": {
            "B1": 0.6
          }
        },
        {
          "id": "B2",
          "text": "Greed is culturally relative; some societies prioritize communal well-being over individual wealth accumulation.",
          "confidence": 0.72,
          "attacks": {
            "A6": 0.7
          }
        },
        {
          "id": "C2",
          "text": "Even in communal societies, greed manifests in competition for status or resources, just in different forms.",
          "confidence": 0.65,
          "attacks": {
            "B2": 0.55
          }
        }
      ]
    }
  }
}