{
  "claim": "Most children would be up past their bedtime if they were watching Conan O'Brien.",
  "Args": {
    "A1": {
      "supporting": {
        "id": "A1",
        "cate": "P",
        "text": "Conan O'Brien's show typically airs late at night, often after 11 PM, which is well past the standard bedtime for most children."
      },
      "attacks": [
        {
          "id": "A1",
          "text": "Conan O'Brien's show typically airs late at night, often after 11 PM, which is well past the standard bedtime for most children.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some children have later bedtimes due to cultural or family-specific routines, and may still be awake during Conan O'Brien's show.",
          "confidence": 0.65,
          "attacks": {
            "A1": 0.55
          }
        },
        {
          "id": "C1",
          "text": "Studies show that most children aged 6-12 in the U.S. have bedtimes between 8-10 PM, making 11 PM significantly later for the majority.",
          "confidence": 0.78,
          "attacks": {
            "B1": 0.7
          }
        },
        {
          "id": "B2",
          "text": "With the rise of DVR and streaming, children could watch Conan O'Brien's show at any time, not necessarily during its late-night airing.",
          "confidence": 0.72,
          "attacks": {
            "A1": 0.8
          }
        },
        {
          "id": "C2",
          "text": "Live viewership still dominates late-night talk shows, and most children watching live would indeed be up past their standard bedtime.",
          "confidence": 0.75,
          "attacks": {
            "B2": 0.65
          }
        }
      ]
    },
    "A2": {
      "supporting": {
        "id": "A2",
        "cate": "P",
        "text": "Children generally have earlier bedtimes, often between 8 PM and 10 PM, while Conan O'Brien's show airs during late-night hours."
      },
      "attacks": [
        {
          "id": "A2",
          "text": "Children generally have earlier bedtimes, often between 8 PM and 10 PM, while Conan O'Brien's show airs during late-night hours.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some children, especially teenagers, may have later bedtimes that overlap with Conan O'Brien's show.",
          "confidence": 0.65,
          "attacks": {
            "A2": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Even for teenagers, late-night shows like Conan O'Brien's typically air past midnight, which is still beyond most adolescent bedtimes.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.7
          }
        },
        {
          "id": "B2",
          "text": "Parental supervision or exceptions (e.g., weekends, holidays) might allow children to stay up late to watch Conan O'Brien.",
          "confidence": 0.55,
          "attacks": {
            "A2": 0.5
          }
        },
        {
          "id": "C2",
          "text": "Such exceptions are rare and do not represent the majority of children's regular sleep schedules.",
          "confidence": 0.8,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    },
    "A3": {
      "supporting": {
        "id": "A3",
        "cate": "P",
        "text": "Late-night talk shows like Conan O'Brien are aimed at adult audiences, and their scheduling reflects this, making it unlikely for children to watch them during typical waking hours."
      },
      "attacks": [
        {
          "id": "A3",
          "text": "Late-night talk shows like Conan O'Brien are aimed at adult audiences, and their scheduling reflects this, making it unlikely for children to watch them during typical waking hours.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some children have later bedtimes or live in households where parents allow them to stay up late, increasing the likelihood of them watching late-night shows.",
          "confidence": 0.65,
          "attacks": {
            "A3": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Studies show that children with later bedtimes often experience negative effects on their health and academic performance, making it less common for parents to allow this.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.8
          }
        },
        {
          "id": "B2",
          "text": "With the rise of streaming platforms, children can watch late-night talk shows at any time, not just during their original late-night slots.",
          "confidence": 0.7,
          "attacks": {
            "A3": 0.75
          }
        },
        {
          "id": "C2",
          "text": "Late-night talk show content is often inappropriate for children, so even if available on streaming, parents are unlikely to permit viewing.",
          "confidence": 0.8,
          "attacks": {
            "B2": 0.85
          }
        }
      ]
    },
    "A4": {
      "supporting": {
        "id": "A4",
        "cate": "P",
        "text": "Parental supervision and routines usually enforce earlier bedtimes for children, further reducing the likelihood of them being awake during Conan O'Brien's broadcast."
      },
      "attacks": [
        {
          "id": "A4",
          "text": "Parental supervision and routines usually enforce earlier bedtimes for children, further reducing the likelihood of them being awake during Conan O'Brien's broadcast.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Many parents allow exceptions to bedtime routines on weekends or special occasions, which could coincide with Conan O'Brien's broadcast.",
          "confidence": 0.7,
          "attacks": {
            "A4": 0.65
          }
        },
        {
          "id": "C1",
          "text": "Studies show that children's sleep schedules are increasingly irregular, with many staying up later regardless of parental supervision.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.6
          }
        },
        {
          "id": "B2",
          "text": "Conan O'Brien's show airs at a time when many children are already asleep due to natural circadian rhythms, independent of parental enforcement.",
          "confidence": 0.8,
          "attacks": {
            "A4": 0.75
          }
        },
        {
          "id": "C2",
          "text": "Children's circadian rhythms can vary widely, and some may naturally stay awake during Conan O'Brien's broadcast time.",
          "confidence": 0.65,
          "attacks": {
            "B2": 0.55
          }
        }
      ]
    },
    "A5": {
      "supporting": {
        "id": "A5",
        "cate": "P",
        "text": "Studies on sleep patterns indicate that children require more sleep than adults, leading to earlier bedtimes that conflict with late-night TV schedules."
      },
      "attacks": [
        {
          "id": "A5",
          "text": "Studies on sleep patterns indicate that children require more sleep than adults, leading to earlier bedtimes that conflict with late-night TV schedules.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Not all children have strict bedtimes; some parents allow flexibility based on circumstances or weekends.",
          "confidence": 0.65,
          "attacks": {
            "A5": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Flexible bedtimes are exceptions, not the norm; most households enforce consistent sleep schedules for children.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.8
          }
        },
        {
          "id": "B2",
          "text": "Conan O'Brien's show airs at different times in different time zones, making 'late-night' relative.",
          "confidence": 0.7,
          "attacks": {
            "A5": 0.55
          }
        },
        {
          "id": "C2",
          "text": "Even with time zone differences, the show airs late relative to typical children's bedtimes in all regions.",
          "confidence": 0.8,
          "attacks": {
            "B2": 0.85
          }
        }
      ]
    }
  }
}