{
  "claim": "System of a Down are opposed to globalization.",
  "Args": {
    "A1": {
      "supporting": {
        "id": "A1",
        "cate": "P",
        "text": "System of a Down's lyrics often critique global economic systems and corporate dominance, reflecting opposition to globalization."
      },
      "attacks": [
        {
          "id": "A1",
          "text": "System of a Down's lyrics often critique global economic systems and corporate dominance, reflecting opposition to globalization.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Critiquing global economic systems does not necessarily equate to opposing globalization as a whole, as the band may support certain aspects like cultural exchange.",
          "confidence": 0.75,
          "attacks": {
            "A1": 0.7
          }
        },
        {
          "id": "C1",
          "text": "System of a Down has not explicitly stated opposition to globalization in interviews, leaving their stance open to interpretation.",
          "confidence": 0.68,
          "attacks": {
            "B1": 0.65
          }
        },
        {
          "id": "B2",
          "text": "Some of System of a Down's lyrics also emphasize unity and shared human experiences, which could align with pro-globalization themes.",
          "confidence": 0.72,
          "attacks": {
            "A1": 0.8
          }
        }
      ]
    },
    "A2": {
      "supporting": {
        "id": "A2",
        "cate": "P",
        "text": "The band has publicly supported anti-globalization movements, such as protests against the World Trade Organization (WTO)."
      },
      "attacks": [
        {
          "id": "A2",
          "text": "The band has publicly supported anti-globalization movements, such as protests against the World Trade Organization (WTO).",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Supporting specific protests does not necessarily mean opposition to globalization as a whole.",
          "confidence": 0.7,
          "attacks": {
            "A2": 0.65
          }
        },
        {
          "id": "C1",
          "text": "The band's lyrics and public statements consistently criticize global economic systems, indicating broader opposition to globalization.",
          "confidence": 0.8,
          "attacks": {
            "B1": 0.75
          }
        },
        {
          "id": "B2",
          "text": "Some members of the band have expressed nuanced views, suggesting their stance may not be uniformly anti-globalization.",
          "confidence": 0.6,
          "attacks": {
            "A2": 0.55
          }
        },
        {
          "id": "C2",
          "text": "Nuanced views by individual members do not negate the band's collective public support for anti-globalization causes.",
          "confidence": 0.75,
          "attacks": {
            "B2": 0.7
          }
        }
      ]
    },
    "A3": {
      "supporting": {
        "id": "A3",
        "cate": "P",
        "text": "Their song 'B.Y.O.B.' criticizes war and economic exploitation, themes commonly associated with anti-globalization sentiments."
      },
      "attacks": [
        {
          "id": "A3",
          "text": "Their song 'B.Y.O.B.' criticizes war and economic exploitation, themes commonly associated with anti-globalization sentiments.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Criticizing war and economic exploitation does not necessarily equate to opposing globalization, as these issues can exist independently of globalization.",
          "confidence": 0.75,
          "attacks": {
            "A3": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Many artists criticize war and economic exploitation without taking a stance on globalization, making the connection speculative.",
          "confidence": 0.68,
          "attacks": {
            "B1": 0.65
          }
        },
        {
          "id": "B2",
          "text": "System of a Down has not explicitly stated opposition to globalization, so linking their lyrics to this stance is an interpretation rather than a fact.",
          "confidence": 0.8,
          "attacks": {
            "A3": 0.75
          }
        },
        {
          "id": "C2",
          "text": "Artistic expression often uses metaphors and indirect criticism, which may not align with clear political or economic stances like anti-globalization.",
          "confidence": 0.72,
          "attacks": {
            "B2": 0.6
          }
        }
      ]
    },
    "A4": {
      "supporting": {
        "id": "A4",
        "cate": "P",
        "text": "System of a Down's members have participated in activism against policies that promote globalization, such as free trade agreements."
      },
      "attacks": [
        {
          "id": "A4",
          "text": "System of a Down's members have participated in activism against policies that promote globalization, such as free trade agreements.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Activism against specific policies does not necessarily equate to opposition to globalization as a whole.",
          "confidence": 0.7,
          "attacks": {
            "A4": 0.65
          }
        },
        {
          "id": "C1",
          "text": "System of a Down has not made explicit statements opposing globalization in its entirety, only specific aspects like free trade agreements.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.8
          }
        },
        {
          "id": "B2",
          "text": "Some members of System of a Down have expressed support for global humanitarian efforts, which could be seen as aligning with certain aspects of globalization.",
          "confidence": 0.68,
          "attacks": {
            "A4": 0.6
          }
        },
        {
          "id": "C2",
          "text": "Humanitarian efforts are not inherently pro-globalization and can exist independently of economic or political globalization.",
          "confidence": 0.72,
          "attacks": {
            "B2": 0.7
          }
        }
      ]
    },
    "A5": {
      "supporting": {
        "id": "A5",
        "cate": "P",
        "text": "The band's Armenian heritage influences their perspective on globalization, as they often highlight historical injustices tied to global power structures."
      },
      "attacks": [
        {
          "id": "A5",
          "text": "The band's Armenian heritage influences their perspective on globalization, as they often highlight historical injustices tied to global power structures.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Not all members of System of a Down have publicly expressed opposition to globalization, indicating potential internal disagreement.",
          "confidence": 0.65,
          "attacks": {
            "A5": 0.6
          }
        },
        {
          "id": "C1",
          "text": "The band's focus on Armenian issues does not necessarily equate to a broad opposition to globalization, as they may support certain aspects of global interconnectedness.",
          "confidence": 0.7,
          "attacks": {
            "B1": 0.5
          }
        },
        {
          "id": "B2",
          "text": "System of a Down has collaborated with international artists and participated in global music festivals, suggesting they are not entirely opposed to globalization.",
          "confidence": 0.8,
          "attacks": {
            "A5": 0.75
          }
        },
        {
          "id": "C2",
          "text": "Collaboration with international artists can be a form of cultural exchange rather than an endorsement of economic or political globalization.",
          "confidence": 0.7,
          "attacks": {
            "B2": 0.65
          }
        }
      ]
    },
    "A6": {
      "supporting": {
        "id": "A6",
        "cate": "P",
        "text": "Their album 'Toxicity' includes themes of cultural erosion and societal decay, which align with critiques of globalization's homogenizing effects."
      },
      "attacks": [
        {
          "id": "A6",
          "text": "Their album 'Toxicity' includes themes of cultural erosion and societal decay, which align with critiques of globalization's homogenizing effects.",
          "cate": "P",
          "confidence": 0.82,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Themes in 'Toxicity' are open to interpretation and may not explicitly target globalization as a singular issue.",
          "confidence": 0.65,
          "attacks": {
            "A6": 0.6
          }
        },
        {
          "id": "B2",
          "text": "Artistic expression does not necessarily equate to a political stance against globalization.",
          "confidence": 0.7,
          "attacks": {
            "A6": 0.75
          }
        },
        {
          "id": "C1",
          "text": "Interviews with band members have shown they critique specific policies, not globalization as a whole.",
          "confidence": 0.78,
          "attacks": {
            "B1": 0.8,
            "B2": 0.85
          }
        },
        {
          "id": "D1",
          "text": "Some lyrics in 'Toxicity' reference broader societal issues unrelated to globalization.",
          "confidence": 0.6,
          "attacks": {
            "A6": 0.55
          }
        }
      ]
    }
  }
}