{
  "claim": "It is hard to get a BLT in Casablanca.",
  "Args": {
    "A1": {
      "supporting": {
        "id": "A1",
        "cate": "P",
        "text": "Casablanca is a predominantly Muslim city where pork is not widely consumed, making it difficult to find bacon, a key ingredient in a BLT."
      },
      "attacks": [
        {
          "id": "A1",
          "text": "Casablanca is a predominantly Muslim city where pork is not widely consumed, making it difficult to find bacon, a key ingredient in a BLT.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some international hotels and restaurants in Casablanca cater to tourists and serve pork-based dishes like BLTs.",
          "confidence": 0.65,
          "attacks": {
            "A1": 0.6
          }
        },
        {
          "id": "C1",
          "text": "These establishments are exceptions and not representative of general availability, as they are few and often expensive.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.7
          }
        },
        {
          "id": "B2",
          "text": "Non-pork alternatives like turkey bacon or beef bacon can be used in BLTs, making them easier to find.",
          "confidence": 0.6,
          "attacks": {
            "A1": 0.5
          }
        },
        {
          "id": "C2",
          "text": "Traditional BLTs require pork bacon, and substitutes significantly alter the taste and authenticity of the dish.",
          "confidence": 0.8,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    },
    "A2": {
      "supporting": {
        "id": "A2",
        "cate": "P",
        "text": "Traditional Moroccan cuisine does not include sandwiches like the BLT, so restaurants may not prioritize offering such items on their menus."
      },
      "attacks": [
        {
          "id": "A2",
          "text": "Traditional Moroccan cuisine does not include sandwiches like the BLT, so restaurants may not prioritize offering such items on their menus.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Many international restaurants and hotels in Casablanca cater to tourists and expats, offering Western dishes like BLTs despite local cuisine norms.",
          "confidence": 0.75,
          "attacks": {
            "A2": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Even in international establishments, ingredient availability (e.g., quality bacon or specific bread) may still limit BLT offerings due to supply chain constraints.",
          "confidence": 0.65,
          "attacks": {
            "B1": 0.6
          }
        },
        {
          "id": "B2",
          "text": "Globalization has increased demand for diverse foods in major cities like Casablanca, prompting more restaurants to include BLTs.",
          "confidence": 0.7,
          "attacks": {
            "A2": 0.65
          }
        },
        {
          "id": "C2",
          "text": "Local preferences still dominate commercial decisions; even with globalization, niche items like BLTs may not justify menu space.",
          "confidence": 0.6,
          "attacks": {
            "B2": 0.55
          }
        }
      ]
    },
    "A3": {
      "supporting": {
        "id": "A3",
        "cate": "S",
        "text": "Casablanca is a cosmopolitan city with many international restaurants and hotels that cater to tourists and expatriates, increasing the likelihood of finding a BLT."
      },
      "attacks": [
        {
          "id": "A3",
          "text": "Casablanca is a cosmopolitan city with many international restaurants and hotels that cater to tourists and expatriates, increasing the likelihood of finding a BLT.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "BLTs require bacon, which is not widely available in Casablanca due to Islamic dietary restrictions.",
          "confidence": 0.85,
          "attacks": {
            "A3": 0.8
          }
        },
        {
          "id": "C1",
          "text": "Some high-end restaurants and hotels in Casablanca import bacon to cater to non-Muslim tourists and expatriates.",
          "confidence": 0.65,
          "attacks": {
            "B1": 0.7
          }
        },
        {
          "id": "D1",
          "text": "Even in high-end establishments, bacon is often expensive and inconsistently available due to import restrictions.",
          "confidence": 0.7,
          "attacks": {
            "C1": 0.75
          }
        },
        {
          "id": "B2",
          "text": "The demand for BLTs in Casablanca is low, so even if bacon is available, few restaurants bother to include it on their menus.",
          "confidence": 0.6,
          "attacks": {
            "A3": 0.65
          }
        },
        {
          "id": "C2",
          "text": "Tourist-heavy areas in Casablanca have restaurants that specifically cater to Western tastes, including BLTs.",
          "confidence": 0.55,
          "attacks": {
            "B2": 0.6
          }
        }
      ]
    },
    "A4": {
      "supporting": {
        "id": "A4",
        "cate": "S",
        "text": "Globalization has led to the spread of Western fast-food chains in major cities like Casablanca, where BLTs may be available in certain establishments."
      },
      "attacks": [
        {
          "id": "A4",
          "text": "Globalization has led to the spread of Western fast-food chains in major cities like Casablanca, where BLTs may be available in certain establishments.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Casablanca's culinary scene remains predominantly Moroccan, with limited availability of Western dishes like BLTs outside tourist-heavy areas.",
          "confidence": 0.65,
          "attacks": {
            "A4": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Even in tourist-heavy areas, Western fast-food chains often adapt menus to local tastes, reducing the likelihood of finding traditional BLTs.",
          "confidence": 0.6,
          "attacks": {
            "B1": 0.55
          }
        },
        {
          "id": "B2",
          "text": "The ingredients for a BLT (bacon, lettuce, tomato) may be culturally or religiously restricted in Casablanca, limiting their availability.",
          "confidence": 0.8,
          "attacks": {
            "A4": 0.85
          }
        },
        {
          "id": "C2",
          "text": "Some high-end hotels or expat-oriented restaurants may import ingredients to serve authentic BLTs, albeit at a premium price.",
          "confidence": 0.5,
          "attacks": {
            "B2": 0.45
          }
        }
      ]
    },
    "A5": {
      "supporting": {
        "id": "A5",
        "cate": "P",
        "text": "Local sourcing of ingredients like fresh lettuce and tomatoes may be seasonal, further complicating the availability of a BLT year-round."
      },
      "attacks": [
        {
          "id": "A5",
          "text": "Local sourcing of ingredients like fresh lettuce and tomatoes may be seasonal, further complicating the availability of a BLT year-round.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Many restaurants in Casablanca import fresh produce, ensuring year-round availability of lettuce and tomatoes.",
          "confidence": 0.65,
          "attacks": {
            "A5": 0.7
          }
        },
        {
          "id": "C1",
          "text": "Importing produce can be expensive, leading some restaurants to limit BLT availability to reduce costs.",
          "confidence": 0.6,
          "attacks": {
            "B1": 0.55
          }
        },
        {
          "id": "B2",
          "text": "BLTs are not a traditional dish in Casablanca, so demand is low and few restaurants prioritize offering them.",
          "confidence": 0.8,
          "attacks": {
            "A5": 0.85
          }
        },
        {
          "id": "C2",
          "text": "Tourist demand for Western dishes like BLTs is increasing in Casablanca, prompting more restaurants to include them on menus.",
          "confidence": 0.7,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    },
    "A6": {
      "supporting": {
        "id": "A6",
        "cate": "S",
        "text": "High-end supermarkets and specialty stores in Casablanca may import bacon and other ingredients, making it possible to assemble a BLT at home."
      },
      "attacks": [
        {
          "id": "A6",
          "text": "High-end supermarkets and specialty stores in Casablanca may import bacon and other ingredients, making it possible to assemble a BLT at home.",
          "cate": "P",
          "confidence": 0.65,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Importing bacon is expensive and not widely accessible to the general population in Casablanca.",
          "confidence": 0.75,
          "attacks": {
            "A6": 0.8
          }
        },
        {
          "id": "C1",
          "text": "Even if bacon is imported, finding fresh lettuce and tomatoes of suitable quality for a BLT can be challenging in Casablanca.",
          "confidence": 0.7,
          "attacks": {
            "B1": 0.6
          }
        },
        {
          "id": "D1",
          "text": "Some high-end restaurants in Casablanca may offer BLTs, making it easier for those who can afford dining out.",
          "confidence": 0.6,
          "attacks": {
            "C1": 0.5
          }
        },
        {
          "id": "B2",
          "text": "Cultural preferences in Casablanca may not favor BLTs, reducing demand and availability.",
          "confidence": 0.8,
          "attacks": {
            "A6": 0.7
          }
        }
      ]
    }
  }
}