{
  "claim": "People in middle school usually get breast exams.",
  "Args": {
    "A1": {
      "supporting": {
        "id": "A1",
        "cate": "S",
        "text": "Breast exams are typically recommended for adult women, not middle school students, as the risk of breast cancer in this age group is extremely low."
      },
      "attacks": [
        {
          "id": "A1",
          "text": "Breast exams are typically recommended for adult women, not middle school students, as the risk of breast cancer in this age group is extremely low.",
          "cate": "S",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some middle school students may have a family history of breast cancer, warranting early screening.",
          "confidence": 0.65,
          "attacks": {
            "A1": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Family history screenings are rare and typically involve genetic counseling rather than routine breast exams.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.7
          }
        },
        {
          "id": "B2",
          "text": "Breast exams in middle school could help educate students about self-examination habits early.",
          "confidence": 0.55,
          "attacks": {
            "A1": 0.5
          }
        },
        {
          "id": "C2",
          "text": "Education about self-exams does not require clinical breast exams, which are invasive and unnecessary for this age group.",
          "confidence": 0.8,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    },
    "A2": {
      "supporting": {
        "id": "A2",
        "cate": "S",
        "text": "Medical guidelines, such as those from the American Cancer Society, do not include breast exams as part of routine health screenings for middle school-aged individuals."
      },
      "attacks": [
        {
          "id": "A2",
          "text": "Medical guidelines, such as those from the American Cancer Society, do not include breast exams as part of routine health screenings for middle school-aged individuals.",
          "cate": "S",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some middle schools may include breast exams as part of health education programs, even if not officially recommended by medical guidelines.",
          "confidence": 0.45,
          "attacks": {
            "A2": 0.35
          }
        },
        {
          "id": "C1",
          "text": "Health education programs in middle schools typically focus on general wellness rather than specific medical screenings like breast exams.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.7
          }
        }
      ]
    },
    "A3": {
      "supporting": {
        "id": "A3",
        "cate": "S",
        "text": "Middle school students are generally not taught or encouraged to perform breast exams, as their bodies are still developing and such exams are not medically necessary at that stage."
      },
      "attacks": [
        {
          "id": "A3",
          "text": "Middle school students are generally not taught or encouraged to perform breast exams, as their bodies are still developing and such exams are not medically necessary at that stage.",
          "cate": "S",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some middle school health education programs include basic self-examination awareness as part of broader puberty education.",
          "confidence": 0.65,
          "attacks": {
            "A3": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Even when mentioned, these programs emphasize these are skills for later adolescence, not immediate practice for middle schoolers.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.8
          }
        },
        {
          "id": "B2",
          "text": "Pediatric guidelines explicitly recommend against breast self-exams for preteens due to low cancer risk and high false alarm potential.",
          "confidence": 0.9,
          "attacks": {
            "A3": 0.3
          }
        },
        {
          "id": "B3",
          "text": "Schools avoid the topic due to parental concerns about sexualizing children, not strictly medical appropriateness.",
          "confidence": 0.7,
          "attacks": {
            "A3": 0.5
          }
        }
      ]
    },
    "A4": {
      "supporting": {
        "id": "A4",
        "cate": "S",
        "text": "Pediatric healthcare focuses on growth, development, and vaccinations, with breast exams being irrelevant to standard care for middle school students."
      },
      "attacks": [
        {
          "id": "A4",
          "text": "Pediatric healthcare focuses on growth, development, and vaccinations, with breast exams being irrelevant to standard care for middle school students.",
          "cate": "S",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some middle school students may require breast exams due to early puberty or family history of breast cancer.",
          "confidence": 0.65,
          "attacks": {
            "A4": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Early puberty cases are statistically rare, and family history screenings are not part of standard middle school healthcare.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.7
          }
        },
        {
          "id": "B2",
          "text": "School nurses occasionally perform basic health screenings that could include breast exams if symptoms are reported.",
          "confidence": 0.55,
          "attacks": {
            "A4": 0.5
          }
        },
        {
          "id": "C2",
          "text": "Such screenings would require parental consent and specific complaints, making them exceptions rather than standard practice.",
          "confidence": 0.8,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    },
    "A5": {
      "supporting": {
        "id": "A5",
        "cate": "S",
        "text": "There is no widespread educational or medical program that targets middle school students for breast exams, further indicating it is not a common practice."
      },
      "attacks": [
        {
          "id": "A5",
          "text": "There is no widespread educational or medical program that targets middle school students for breast exams, further indicating it is not a common practice.",
          "cate": "S",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "Some schools or regions may have localized health programs that include breast exams for middle school students, especially in areas with higher breast cancer risk factors.",
          "confidence": 0.55,
          "attacks": {
            "A5": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Even in regions with such programs, participation rates are typically low, and they are not representative of a 'usual' practice for middle school students nationwide.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.8
          }
        },
        {
          "id": "B2",
          "text": "Breast exams are generally recommended for older adolescents or adults, not middle school students, as the risk of breast cancer is extremely low in this age group.",
          "confidence": 0.9,
          "attacks": {
            "A5": 0.3
          }
        },
        {
          "id": "B3",
          "text": "Parental consent and cultural sensitivities often prevent the implementation of breast exam programs for middle school students, reinforcing their rarity.",
          "confidence": 0.7,
          "attacks": {
            "A5": 0.5
          }
        }
      ]
    }
  }
}