{
  "claim": "The war doctor got more screen time than his successor in Doctor Who.",
  "Args": {
    "A1": {
      "supporting": {
        "id": "A1",
        "cate": "P",
        "text": "The War Doctor, portrayed by John Hurt, had a significant role in the 50th-anniversary special 'The Day of the Doctor,' which was a major multi-Doctor story and gave him substantial screen time."
      },
      "attacks": [
        {
          "id": "A1",
          "text": "The War Doctor, portrayed by John Hurt, had a significant role in the 50th-anniversary special 'The Day of the Doctor,' which was a major multi-Doctor story and gave him substantial screen time.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "The War Doctor's successor, the Twelfth Doctor (Peter Capaldi), appeared in multiple full seasons, providing far more cumulative screen time than the War Doctor's single special.",
          "confidence": 0.9,
          "attacks": {
            "A1": 0.8
          }
        },
        {
          "id": "C1",
          "text": "'The Day of the Doctor' was a high-profile event with extensive focus on the War Doctor, making his screen time in that episode more impactful than his successor's spread-out appearances.",
          "confidence": 0.75,
          "attacks": {
            "B1": 0.7
          }
        },
        {
          "id": "D1",
          "text": "The Twelfth Doctor's seasons included many episodes where he shared significant screen time with companions or other characters, reducing his individual focus compared to the War Doctor's concentrated role.",
          "confidence": 0.65,
          "attacks": {
            "B1": 0.6
          }
        }
      ]
    },
    "A2": {
      "supporting": {
        "id": "A2",
        "cate": "S",
        "text": "The War Doctor appeared in only one televised story, whereas his successor, the Twelfth Doctor (Peter Capaldi), had three full seasons, resulting in far more screen time for the latter."
      },
      "attacks": [
        {
          "id": "A2",
          "text": "The War Doctor appeared in only one televised story, whereas his successor, the Twelfth Doctor (Peter Capaldi), had three full seasons, resulting in far more screen time for the latter.",
          "cate": "P",
          "confidence": 0.95,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "The War Doctor's appearance in 'The Day of the Doctor' was a special 50th-anniversary episode with extended runtime, which may offset some of the difference in screen time compared to individual episodes of the Twelfth Doctor.",
          "confidence": 0.65,
          "attacks": {
            "A2": 0.6
          }
        },
        {
          "id": "C1",
          "text": "Even with extended runtime, a single episode cannot match the cumulative screen time of three full seasons, which typically consist of 12-13 episodes each.",
          "confidence": 0.85,
          "attacks": {
            "B1": 0.8
          }
        },
        {
          "id": "B2",
          "text": "The War Doctor also appeared in audio dramas and other media, which could contribute to his overall screen time if considered.",
          "confidence": 0.55,
          "attacks": {
            "A2": 0.5
          }
        },
        {
          "id": "C2",
          "text": "The claim specifically refers to televised screen time, so non-televised appearances like audio dramas should not be counted.",
          "confidence": 0.9,
          "attacks": {
            "B2": 0.85
          }
        }
      ]
    },
    "A3": {
      "supporting": {
        "id": "A3",
        "cate": "P",
        "text": "The War Doctor's arc was central to the resolution of the Time War, a pivotal event in Doctor Who lore, which may give the impression of greater narrative weight and screen presence."
      },
      "attacks": [
        {
          "id": "A3",
          "text": "The War Doctor's arc was central to the resolution of the Time War, a pivotal event in Doctor Who lore, which may give the impression of greater narrative weight and screen presence.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "The War Doctor appeared in only one full episode ('The Day of the Doctor'), whereas his successor (the Ninth Doctor) had an entire season.",
          "confidence": 0.85,
          "attacks": {
            "A3": 0.8
          }
        },
        {
          "id": "C1",
          "text": "The War Doctor's impact is amplified by his role in the 50th anniversary special, which had higher viewership and cultural significance than regular episodes.",
          "confidence": 0.7,
          "attacks": {
            "B1": 0.65
          }
        },
        {
          "id": "B2",
          "text": "Screen time should be measured in minutes, not narrative weight. The Ninth Doctor objectively had more cumulative screen time across multiple episodes.",
          "confidence": 0.9,
          "attacks": {
            "A3": 0.85
          }
        },
        {
          "id": "C2",
          "text": "The War Doctor's scenes in 'The Day of the Doctor' were heavily featured in promotional material, creating a recency bias in audience perception.",
          "confidence": 0.68,
          "attacks": {
            "B2": 0.6
          }
        }
      ]
    },
    "A4": {
      "supporting": {
        "id": "A4",
        "cate": "S",
        "text": "The Twelfth Doctor's tenure included numerous standalone episodes, two-parters, and major story arcs, cumulatively dwarfing the War Doctor's limited appearances."
      },
      "attacks": [
        {
          "id": "A4",
          "text": "The Twelfth Doctor's tenure included numerous standalone episodes, two-parters, and major story arcs, cumulatively dwarfing the War Doctor's limited appearances.",
          "cate": "P",
          "confidence": 0.85,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "The War Doctor appeared in the 50th anniversary special 'The Day of the Doctor', which had a significantly higher viewership and cultural impact than most of the Twelfth Doctor's episodes.",
          "confidence": 0.75,
          "attacks": {
            "A4": 0.7
          }
        },
        {
          "id": "C1",
          "text": "The Twelfth Doctor's episodes spanned three full seasons, while the War Doctor only appeared in one special and brief cameos, making his total screen time objectively less.",
          "confidence": 0.9,
          "attacks": {
            "B1": 0.85
          }
        },
        {
          "id": "B2",
          "text": "The War Doctor's screen time is concentrated in pivotal moments of the Doctor Who lore, making his appearances more memorable and impactful per minute than the Twelfth Doctor's.",
          "confidence": 0.65,
          "attacks": {
            "A4": 0.6
          }
        },
        {
          "id": "C2",
          "text": "Memorability does not equate to screen time; the claim is strictly about duration, not impact or narrative importance.",
          "confidence": 0.8,
          "attacks": {
            "B2": 0.75
          }
        }
      ]
    },
    "A5": {
      "supporting": {
        "id": "A5",
        "cate": "P",
        "text": "The War Doctor's impact was amplified by his portrayal as a hidden incarnation, making his screen time feel more concentrated and memorable despite its brevity."
      },
      "attacks": [
        {
          "id": "A5",
          "text": "The War Doctor's impact was amplified by his portrayal as a hidden incarnation, making his screen time feel more concentrated and memorable despite its brevity.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "The War Doctor appeared in only one full episode and a few scenes, while his successor had multiple full episodes, making the claim about screen time objectively incorrect.",
          "confidence": 0.85,
          "attacks": {
            "A5": 0.8
          }
        },
        {
          "id": "C1",
          "text": "Screen time perception is subjective; the War Doctor's unique narrative weight could make his limited appearances feel more significant than his successor's longer but less impactful screen time.",
          "confidence": 0.7,
          "attacks": {
            "B1": 0.65
          }
        },
        {
          "id": "B2",
          "text": "The War Doctor's screen time was limited to the 50th anniversary special, while his successor had recurring appearances across multiple episodes, disproving the claim numerically.",
          "confidence": 0.9,
          "attacks": {
            "A5": 0.85
          }
        },
        {
          "id": "C2",
          "text": "The War Doctor's role as a bridge between classic and modern Who inherently made his screen time more memorable, regardless of duration.",
          "confidence": 0.68,
          "attacks": {
            "B2": 0.6
          }
        }
      ]
    },
    "A6": {
      "supporting": {
        "id": "A6",
        "cate": "S",
        "text": "The Twelfth Doctor's era included extended episodes like 'Heaven Sent,' which alone provided more screen time than the War Doctor's entire on-screen presence."
      },
      "attacks": [
        {
          "id": "A6",
          "text": "The Twelfth Doctor's era included extended episodes like 'Heaven Sent,' which alone provided more screen time than the War Doctor's entire on-screen presence.",
          "cate": "P",
          "confidence": 0.75,
          "attacks": {}
        },
        {
          "id": "B1",
          "text": "The War Doctor appeared in the 50th anniversary special 'The Day of the Doctor,' which had a longer runtime than 'Heaven Sent.'",
          "confidence": 0.85,
          "attacks": {
            "A6": 0.8
          }
        },
        {
          "id": "C1",
          "text": "'Heaven Sent' is a single episode, while the War Doctor also appeared in other media like audio dramas, expanding his screen time beyond just TV.",
          "confidence": 0.7,
          "attacks": {
            "B1": 0.6
          }
        },
        {
          "id": "D1",
          "text": "Audio dramas and other non-TV appearances are not typically counted in screen time comparisons, which focus on televised content.",
          "confidence": 0.8,
          "attacks": {
            "C1": 0.9
          }
        }
      ]
    }
  }
}